//; Уровень 2.1 задачника JavaScript

//! =============================================

//? №1
//? Дана некоторая строка. Найдите позицию первого нуля в строке.

// const str = '102503';
// const res = str.indexOf('0')
// console.log(res + 1);

//! =============================================

//? №2
//? Выведите в консоль все числа в промежутке от 1 до 1000, сумма первой и второй цифры которых равна пяти.


// for (let i = 10; i <= 1000; i += 1) {
//     const str = String(i);
//     if (Number(str[0]) + Number(str[1]) === 5) {
//       console.log(i);
//     };
//     };

   

//! =============================================

//? №3
//? Дан массив. Удалите из него элементы с заданным значением.

// const arr = [2, 6, 9, 8, 5, 0];
// const arrRes = arr.filter(n => n !== 0);
// console.log(arrRes);

//! =============================================

//? №4
//? Дан некоторый массив, например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? Найдите сумму первой половины элементов этого массива.

// const arr = [1, 2, 3, 4, 5, 6];
// let sum = 0;
// for (let i = 0; i < arr.length / 2; i++) {
//     sum += arr[i];
// }
// console.log(sum);

//! =============================================

//; Уровень 2.2 задачника JavaScript

//! =============================================

//? №1
//? Дан массив с числами. Подсчитайте количество отрицательных чисел в этом массиве.

// const arr = [1, -2, 3, -4, 5, 6];
// const arr1 = arr.filter(n => n < 0);
// console.log(arr1.length);

//! =============================================

//? №2
//? Дан массив с числами. Оставьте в нем только положительные числа.

// const arr = [1, -2, 3, -4, 5, 6];
// console.log(arr.filter(n => n > 0));

//! =============================================

//? №3
//? Дана строка. Удалите предпоследний символ из этой строки.

// const str = 'Andrii10';
// console.log(str.slice(0, -2)+str.slice(str.length-1));

//! =============================================

//? №4
//? Дан некоторый массив, например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? Поделите сумму первой половины элементов этого массива на сумму второй половины элементов.

// const arr = [1, 2, 3, 4, 5, 6];
// console.log(arr.length / 2);
// const sum1 = arr.slice(0, arr.length / 2).reduce((x, n) => x + n, 0);
// const sum2 = arr.slice(arr.length / 2).reduce((x, n) => x + n, 0);
// console.log(sum1 / sum2);

//! =============================================

//; Уровень 2.3 задачника JavaScript

//! =============================================

//? №1
//? Даны два слова. Проверьте, что последняя буква первого слова совпадает с первой буквой второго слова.

// const str1 = 'Andrii';
// const str2 = 'Ira';
// console.log(str1[str1.length - 1].toLowerCase() === str2[0].toLowerCase());

//! =============================================

//? №2
//? Дана некоторая строка. Найдите позицию третьего нуля в строке.

// const str = '1020304050';
// let count = 0;

// for (let i = 0; i < str.length; i++) {
//   if (str[i] === '0') {
//     count++;
//     if (count === 3) {
//       console.log(i + 1); // позиция, а не индекс
//       break;
//     }
//   }
// }


//! =============================================

//? №3
//? Даны числа, разделенные запятыми:
//? '12,34,56'
//? Найдите сумму этих чисел.

// const str = '12,34,56';
// console.log(str.split(',').reduce((x, n) => x + Number(n), 0));

//! =============================================

// №4

//? Дана дата в следующем формате:
//? '2025-12-31'
//? Преобразуйте эту дату в следующий объект:
//? {
//? 	year: '2025',
//? 	month: '12',
//? 	day: '31',
//? }

// const data = '2025-12-31';
// const [year, month, day] = data.split('-');
// const obj = { year, month, day };
// console.log(obj);



//! =============================================

//; Уровень 2.4 задачника JavaScript

//! =============================================

//? №1
//? Дана некоторая строка с буквами и цифрами. Получите позицию первой цифры в этой строке.

// const str = 'and123';
// const arr = str.split('');
//     for (let i = 0; i < arr.length; i++) {
//     if (!isNaN(Number(arr[i])) && arr[i] !== ' ') {
//         console.log(i + 1);
//         break;
//     }
// };


//! =============================================

//? №2
//? Дан объект с ключами и значениями. Запишите в первый массив ключи объекта, а во второй - значения.

// const obj = {
//     name: 'Andrii',
//     old: 50,
// };
// console.log(Object.keys(obj));
// console.log(Object.values(obj));

//! =============================================

//? №3
//? Дано число. Выведите в консоль количество четных цифр в этом числе.

// const num = '123456789';
// const quantity = num.split('').filter(n => n % 2 === 0);
// console.log(quantity.length);

//! =============================================

//? №4
//? Дана некоторая строка:
//? 'abcde'
//? Переведите в верхний регистр все нечетные буквы этой строки. В нашем случае должно получится следующее:
//? 'AbCdE'

// const str = 'abcde';
// const res = str.split('');
// let res1 = []
// for (let i = 0; i < res.length; i++) {
//     if (i % 2 === 0) {
//         res1.push(res[i].toUpperCase());
//     } else {
//         res1.push(res[i].toLowerCase());
//     }
// }
//  console.log(res1.join(''));

//! =============================================

//? №5
//? Дана некоторая строка со словами:
//? 'aaa bbb ccc'
//? Сделайте заглавным первый символ каждого слова в этой строке. В нашем случае должно получится следующее:
//? 'Aaa Bbb Ccc'

// const str = 'aaa bbb ccc';
// const arr = str.split(' ');
// const res = [];
// for (let i = 0; i < arr.length; i++) {
//     res.push(arr[i][0].toUpperCase() + arr[i].slice(1));
// }
// console.log(res.join(' '));

//! =============================================

//; Уровень 2.5 задачника JavaScript

//! =============================================

//? №1
//? Дана некоторая строка, например, вот такая:
//? '023m0df0dfg0'
//? Получите массив позиций всех нулей в этой в строке.

// const str = '023m0df0dfg0';
// const arr = [];
// for (let i = 0; i < str.length; i++) {
//     if (str[i] === '0') {
//         arr.push(i + 1);
//     };
// };
//  console.log(arr);

//! =============================================

//? №2
//? Дана некоторая строка:
//? 'abcdefg'
//? Удалите из этой строки каждый третий символ. В нашем случае должно получится следующее:
//? 'abdeg'

// const str = 'abcdefg';
// let res = '';
// for (let i = 0; i < str.length; i++) {
//     if ((i + 1) % 3 !== 0) {
//         res += str[i];
//     }
// };
// console.log(res);

//! =============================================

//? №3
//? Дан некоторый массив, например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? Поделите сумму элементов, стоящих на четных позициях, на сумму элементов, стоящих на нечетных позициях.

// const arr = [1, 2, 3, 4, 5, 6];
// let ch = 0;
// let nech = 0;
//  for (let i = 0; i < arr.length; i++) {
//      if (i % 2 === 0) {
//          ch += arr[i];
//      } else {
//          nech += arr[i];
//      }
// }
// console.log(ch / nech);


//! =============================================

//; Уровень 2.6 задачника JavaScript

//! =============================================

//? №1
//? Дана некоторая строка с буквами и цифрами. Получите массив позиций всех цифр из этой строки.

// const arr = [1, 'b', 'x', 3, 4, 'j', 5, 6];
// const res = [];
// for (let i = 0; i < arr.length; i++) {
//     if ((!isNaN(Number(arr[i])) && arr[i] !== ' ')) {
//         res.push(i + 1);
//     }
// }
// console.log(res);
    
//! =============================================

//? №2
//? Дан массив с некоторыми числами, например, вот такой:
//? [123, 456, 789]
//? Напишите код, который перевернет числа в этом массиве по следующему принципу:
//? [321, 654, 987]

// const arr = [123, 456, 789];
// const res = arr.map(n => Number(String(n).split('').reverse().join('')));
// console.log(res);

//! =============================================

//? №3
//? Дана некоторая строка с числом:
//? '1234567'
//? Отделите тройки цифр пробелами, начиная с конца числа. В нашем случае должно получится следующее:
//? '1 234 567'

// const str = '1234567';
// const res = str
//   .split('')
//   .reverse()
//   .join('')
//   .match(/.{1,3}/g)
//   .join(' ')
//   .split('')
//   .reverse()
//   .join('');
// console.log(res); // 1 234 567

//! =============================================

//? №4
//? Дана некоторая строка:
//? 'AbCdE'
//? Смените регистр букв этой строки на противоположный. В нашем случае должно получится следующее:
//? 'aBcDe'

// const str = 'AbCdE';
// const res = str.split('').map(n => n === n.toUpperCase() ? n.toLowerCase() : n.toLocaleUpperCase());
// console.log(res.join(''));

//! =============================================

//? №5
//? Дан некоторый массив с числами,  например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? Слейте пары элементов вместе:
//? [12, 34, 56]

// const arr = [1, 2, 3, 4, 5, 6];
// const arrRes = [];
// for (let i = 0; i < arr.length; i += 2) {
// arrRes.push(Number(String(arr[i]) + String(arr[i + 1])));
// }
// console.log(arrRes);

//! =============================================

//? №6
//? Дана некоторая строка со словами:
//? 'aaa bbb ccc eee fff'
//? Сделайте заглавным первый символ каждого второго слова в этой строке. В нашем случае должно получится следующее:
//? 'aaa Bbb ccc Eee fff'

// const str = 'aaa bbb ccc eee fff';
// let str1 = str.split(' ');
// for (let i = 1; i < str1.length; i += 2) {
//  str1[i] = str1[i][0].toUpperCase() + str1[i].slice(1);
// };
// const res = str1.join(' ');
// console.log(res);

//! =============================================

//; Уровень 2.7 задачника JavaScript

//! =============================================

//? №1
//? Дана некоторая строка:
//? 'a bc def ghij'
//? Переведите в верхний регистр все подстроки, в которых количество букв меньше или равно трем. В нашем случае должно получится следующее:
//? 'A BC DEF ghij'

// const str = 'a bc def ghij';
// const res = str
// .split(' ')
// .map(n => n.length <= 3 ? n.toUpperCase() : n)
// .join(' ');
// console.log(res);

//! =============================================

//? №2
//? Дан символ. Узнайте, в каком регистре этот символ - в верхнем или нижнем.

// const str = prompt('Введите символ:  ');
// str.toLowerCase() !== str.toUpperCase() ? (str === str.toUpperCase() ? console.log('Символ в верхнем регистре') : console.log('Символ в нижнем регистре')) : console.log('Це не Символ');

//! =============================================

//? №3
//? Дано некоторое число, например, такое:
//? 123789
//? Удалите из этого числа все нечетные цифры. В нашем случае получится такой результат:
//? 28

// const num = 123789;
// const res = Number(String(num).split('').filter(n => n % 2 === 0).join(''));
// console.log(res);

//! =============================================

//; Уровень 2.8 задачника JavaScript

//! =============================================

//? №1
//? Дана строка с буквами. Проверьте, что в этой строке не более двух заглавных букв.

// const str = 'aBbcNefghij';
// const quantity = str.split('').filter(n => n === n.toUpperCase());
// console.log(quantity.length <= 2);

//! =============================================


//? №2
//? Дана некоторая строка:
//? '1 22 333 4444 22 5555 1'
//? Удалите из этой строки все подстроки, в которых количество символов больше трех. В нашем случае должно получится следующее:
//? '1 22 333 22 1'

// const str = '1 22 333 4444 22 5555 1';
// const res = str.split(' ').filter(n => n.length <= 3).join(' ');
// console.log(res);

//! =============================================

//? №3
//? Даны два массива:
//? let arr1 = [1, 2, 3];
//? let arr2 = ['a', 'b', 'c'];
//? Слейте эти массивы в новый массив следующим образом:
//? [1, 2, 'a', 'b', 'c', 3]

// let arr1 = [1, 2, 3];
// let arr2 = ['a', 'b', 'c'];
// arr1.splice(2, 0, ...arr2);
// console.log(arr1);

//! =============================================

//; Уровень 2.9 задачника JavaScript

//! =============================================

//? №1
//? Дано некоторое число:
//? 123456
//? Найдите сумму пар цифр этого числа. В нашем случае имеется ввиду следующее:
//? 12 + 34 + 56

// const num = 123456;
// let str = String(num).split('');
// let res = '';
// for (let i = 0; i < str.length; i += 2) {
// res += str[i] + str[i + 1] + ' + ';
// }
// console.log(res.slice(0, -3));

//! =============================================

// №2

// Дан массив с числами:

// [1, 2, 3, 4, 5]
// Выведите в консоль элементы этого массива в обратном порядке.


// Уровень 2.10 задачника JavaScript
// №1

// Дана строка с буквами и цифрами. Проверьте, что в этой строке не более трех букв.

// №2

// Дано число. Получите первую четную цифру с конца этого числа.

// №3

// Дана некоторая строка:

// 'abcde abcde abcde'
// Замените в ней первый символ каждого слова на '!':

// '!bcde !bcde !bcde'
// №4

// Дан массив с числами:

// [1, 2, 3, 3, 4, 5]
// Проверьте, что в этом массиве есть два одинаковых элемента подряд.



