// Уровень 6.1 задачника JavaScript
// №1

// Дана кнопка, пустой список ul и массив. По клику на кнопку заполните список элементами этого массива.

// №2

// Дана кнопка и пустой список ul. По клику на кнопку заполните список числами от 1 до 10.

// №3

// Дана кнопка и пустой список ul. По клику на кнопку добавьте в конец списка новый пункт с текстом '!'.

// №4

// Дана кнопка и пустой список ul. По клику на кнопку добавьте в конец списка новый пункт с порядковым номером.

// №5

// Дана кнопка и список ul, заполненный пунктами. По клику на кнопку удалите последний пункт списка.

// №6

// Дана кнопка и список ul, заполненный пунктами.По клику на кнопку удалите случайный пункт списка.





// Уровень 6.2 задачника JavaScript
// №1

// По клику на кнопку создайте HTML таблицу с заданной шириной и высотой.

// №2

// По клику на кнопку создайте HTML таблицу с заданной шириной и высотой так, чтобы в ячейках стояли их порядковые номера.

// №3

// По клику на кнопку создайте HTML таблицу с заданной шириной и высотой так, чтобы в ячейках стояли номера их рядов и колонок.

// №4

// Дан массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]
// По нажатию на кнопку создайте таблицу, заполненную данными из этого массива.





// Уровень 6.3 задачника JavaScript
// №1

// Дан абзац и кнопка. Пусть первое нажатие на кнопку красит абзац в красный цвет, а второе нажатие в зеленый.

// №2

// Дан список ul. По клику на любую li добавьте ей в конец ее порядковый номер в списке, но только один раз.

// №3

// Дан список ul. По клику на любую li, если нажата клавиша Ctrl, удалите эту li из списка.

// №4

// Дан абзац с числом и кнопка. По нажатию на кнопку пусть число из абзаца каждую секунду увеличивается на единицу.

// №5

// Дан инпут и абзац.В инпут вводится дата.Определите, была уже дата в текущем году.Результат выведите в абзац.




// Уровень 6.4 задачника JavaScript
// №1

// Дан список ul. Сделайте так, чтобы по клику на любую li она удалялась из списка.

// №2

// Дан список ul и инпут. Сделайте так, чтобы по потери фокуса инпутом его текст становился новым пунктом списка.

// №3

// Дана таблица из трех колонок, три инпута и кнопка. Сделайте так, чтобы по клику на кнопку в таблицу добавлялся новый ряд с текстами ячеек из инпутов.

// №4

// Дан инпут и ul.В инпут вводится год.Выведите в список даты всех пятниц 13 - е в заданном году.



// Уровень 6.5 задачника JavaScript
// №1

// Дан абзац и инпут. В инпут вводится дата рождения юзера в формате год-месяц-день. Выведите в абзац, сколько полных лет юзеру.

// №2

// Дан абзац и инпут. В инпут вводятся числа, разделенные запятыми. Сделайте так, чтобы по мере ввода данных в инпут в абзац выводилась сумма введеных чисел.

// №3

// Дан абзац и кнопка. Каждое нажатие на кнопку добавляет новый инпут. В инпуты вводятся числа. Сделайте так, чтобы по мере ввода чисел в инпуты в абзац выводилась сумма введеных чисел.

// №4

// Дано произвольное количество инпутов и кнопка. В инпуты вводятся числа. По нажатию на кнопку найдите сумму введенных чисел и выведите в текст кнопки.

// №5

// Даны два инпута, абзац и кнопка.В инпуты через запятую вводятся числа.По клику на кнопку выведите через запятую в абзац числа, которые есть в обоих инпутах.






// Уровень 6.6 задачника JavaScript
// №1

// Дан массив, инпут, кнопка и абзац. В инпут вводится число. По нажатию на кнопку выведите в абзац элемент массива, номер которого введен в инпут.

// №2

// Дан абзац, кнопка и массив с цветами. Пусть нажатие на кнопку красит абзац в случайный цвет из массива.

// №3

// Дана таблица, кнопка и массив с цветами. Пусть нажатие на любую ячейку красит ее в случайный цвет из массива цветов.

// №4

// Дан текстареа и див.В текстареа вводится текст.Сделайте так, чтобы по нажатию Shift + Enter этот текст добавился в див.





// Уровень 6.7 задачника JavaScript
// №1

// Выведите даты всех выходных дней текущего года в виде списка ul.

// №2

// Дан абзац и кнопка. По клику на кнопку выведите в абзац название дня недели последнего дня текущего месяца.

// №3

// Дана кнопка и селект. По клику на кнопку заполните селект числами от первого до последнего дня текущего месяца.

// №4

// Дан инпут, кнопка и абзац.В инпут вводится число.По нажатию на кнопку выведите в абзац строку, состоящую из нулей, количество которых равно числу.Например, при вводе числа 5 у нас должна получится строка '00000'.






// Уровень 6.8 задачника JavaScript
// №1

// Дана таблица. По клику на ячейку, если нажата клавиша Shift, красьте ячейку в красный цвет, а если клавиша Ctrl, то в зеленый.

// №2

// Дан див и кнопка.По первому клику на кнопку покажите див, а по второму клику - спрячьте.





// Уровень 6.9 задачника JavaScript
// №1

// Дан абзац, кнопка и массив с цветами. Пусть нажатие на кнопку красит абзац в следующий цвет из массива и так по кругу.

// №2

// Дан абзац и два инпута. В инпуты вводятся даты. Выведите в абзац, сколько дней между введенными датами.

// №3

// Дан список ul. По клику на любую li записывайте в конец ее текста порядковый номер клика по этой li.

// №4

// Дана кнопка и список ul, заполненный пунктами с числами.По клику на кнопку добавляйте новую li с числом, на единицу больше числа последей li из списка.




// Уровень 6.10 задачника JavaScript
// №1

// Дана кнопка, инпут и список ul, В инпут вводится текст. По клику на кнопку добавьте в список новую li с этим текстом, но только если этот текст больше текста последнего тега li из списка.

// №2

// Сделайте вручную HTML таблицу 8 на 8. По нажатию на кнопку покрасьте каждую четную ячейку в белый цвет, а нечетную - в черный.

// №3

// Напишите код, который выведет на экран таблицу умножения.

// №4

// Даны текстареа, инпут и кнопка. В текстареа вводится текст со словами. В инпут вводится слово. По нажатию на кнопку выведите на экран, сколько раз встречается это слово в веденном тексте.