// Уровень 3.1 задачника JavaScript
// №1

// Дано некоторое число. Проверьте, что цифры этого числа расположены по возрастанию.

// №2

// Дан массив:

// [1, '', 2, 3, '', 5]
// Удалите из массива все пустые строки.

// №3

// Дан массив:

// [
// 	[2, 1, 4, 3, 5],
// 	[3, 5, 2, 4, 1],
// 	[4, 3, 1, 5, 2],
// ]
// Отсортируйте элементы в каждом подмассиве.

// №4

// Даны два массива:

// let arr1 = [1, 2, 3];
// let arr2 = [1, 2, 3, 4, 5];
// Удалите из большего массива лишние элементы с конца так, чтобы длины массивов стали одинаковыми.





// Уровень 3.2 задачника JavaScript
// №1

// Выведите в консоль все числа в промежутке от 10 до 1000, у которых предпоследняя цифра четная.

// №2

// Дан массив. Удалите из него каждый пятый элемент.

// №3

// Дана некоторая переменная с числом:

// let num = 5;
// Сделайте строку, содержащую столько нулей, сколько указано в переменной. В нашем случае получится такая строка:

// '00000'
// №4

// Дана некоторая строка со словами:

// 'aaa bbb ccc eee fff'
// Удалите из этой строки каждое второе слово. В нашем случае должно получится следующее:

// 'aaa ccc fff'
// №5

// Дан массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]
// Найдите сумму элементов этого массива.



// Уровень 3.3 задачника JavaScript
// №1

// Дан массив со словами. Удалите из него слова, состоящие более чем из трех символов.

// №2

// Дано некоторое число:

// 1357
// Проверьте, что все цифры этого числа являются нечетными.

// №3

// Дано некоторое слово:

// 'abcba'
// Проверьте, что это слово читается одинаково с любой стороны.

// №4

// Дан массив:

// [
// 	[
// 		[11, 12, 13],
// 		[14, 15, 16],
// 		[17, 17, 19],
// 	],
// 	[
// 		[21, 22, 23],
// 		[24, 25, 26],
// 		[27, 27, 29],
// 	],
// 	[
// 		[31, 32, 33],
// 		[34, 35, 36],
// 		[37, 37, 39],
// 	],
// ]
// Найдите сумму элементов этого массива.



// Уровень 3.4 задачника JavaScript
// №1

// Выведите в консоль все числа в промежутке от 10 до 1000, у которых первая цифра четная.

// №2

// Дан некоторый массив, например, вот такой:

// [1, 2, 3, 4, 5, 6]
// Поменяйте местами пары элементов этого массива:

// [2, 1, 4, 3, 6, 5]
// №3

// Дан следующий объект:

// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }
// Найдите сумму элементов этого объекта.



// Уровень 3.5 задачника JavaScript
// №1

// Дан текст со словами. Запишите в массив все слова, начинающиеся на букву 'a'.

// №2

// Дан массив с числами. Оставьте в нем только те числа, которые делятся на 5.

// №3

// Дан массив с числами. Оставьте в нем только те числа, которые содержат цифру ноль.

// №4

// Дан массив со числами. Проверьте, что в нем есть число, содержащее в себе цифру 3.

// №5

// Дано некоторое число:

// 35142
// Отсортируйте цифры этого числа. В нашем случае должно получится следующее:

// 12345
// №6

// Напишите программу, которая сформирует следующую строку:

// '-1-2-3-4-5-'
// №7

// Дан следующий объект:

// let obj = {
// 	1: {
// 		1: {
// 			1: 111,
// 			2: 112,
// 			3: 113,
// 		},
// 		2: {
// 			1: 121,
// 			2: 122,
// 			3: 123,
// 		},
// 	},
// 	2: {
// 		1: {
// 			1: 211,
// 			2: 212,
// 			3: 213,
// 		},
// 		2: {
// 			1: 221,
// 			2: 222,
// 			3: 223,
// 		},
// 	},
// 	3: {
// 		1: {
// 			1: 311,
// 			2: 312,
// 			3: 313,
// 		},
// 		2: {
// 			1: 321,
// 			2: 322,
// 			3: 323,
// 		},
// 	},
// }
// Найдите сумму элементов этого объекта.





// Уровень 3.6 задачника JavaScript
// №1

// Дан массив со числами. Удалите из него числа, состоящие более чем из трех цифр.

// №2

// Дано число, например, вот такое:

// let num = 12345;
// Проверьте, что все цифры этого числа больше нуля.

// №3

// Дан некоторый массив, например, вот такой:

// [123, 456, 789]
// Слейте все элементы этого массива в один массив, разбив их посимвольно:

// [1, 2, 3, 4, 5, 6, 7, 8, 9]
// №4

// Дан следующая структура:

// let data = [
// 	{
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	{
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	{
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// ];
// Найдите сумму элементов этой структуры.




// Уровень 3.7 задачника JavaScript
// №1

// Дана строка со словами. Отсортируйте слова в алфавитном порядке.

// №2

// Дано число. Получите массив делителей этого числа.

// №3

// Даны два числа. Получите массив общих делителей этих чисел.

// №4

// Дано число. Проверьте, что у этого числа есть только один делитель, кроме него самого и единицы.

// №5

// Через запятую написаны числа. Получите максимальное из этих чисел.

// №6

// Дан массив с числами. После каждого однозначного числа вставьте еще такое же.

// №7

// Дана строка. Удалите из нее все гласные буквы.

// №8

// Дана строка. Сделайте заглавной последнюю букву каждого слова в этой строке.

// №9

// Дан следующая структура:

// let data = [
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// ];
// Найдите сумму элементов этой структуры.



// Уровень 3.8 задачника JavaScript
// №1

// Дан массив со числами. Проверьте, что все числа из этого массива содержат в себе цифру 3.

// №2

// Дана строка в формате:

// 'kebab-case'
// Преобразуйте ее в формат:

// 'snake_case'
// №3

// Дана строка в формате:

// 'snake_case'
// Преобразуйте ее в формат:

// 'camelCase'
// №4

// Дана строка в формате:

// 'camelCase'
// Преобразуйте ее в формат:

// 'snake_case'
// №5

// Сформируйте с помощью циклов следующий массив:

// [
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// ]






// Уровень 3.9 задачника JavaScript
// №1

// Дана строка. Проверьте, что эта строка состоит только из цифр.

// №2

// Дана строка. Проверьте, что эта строка состоит только из четных цифр.

// №3

// Дан массив со числами. Удалите из него числа, имеющие два и более нуля.

// №4

// Найдите все числа от 1 до 1000, сумма цифр которых равна 13.

// №5

// Сформируйте с помощью циклов следующий массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]






// Уровень 3.10 задачника JavaScript
// №1

// Дан массив. Сделайте так, чтобы в нем каждый элемент повторился два раза.

// №2

// Дан массив и число. Оставьте в массиве только те числа, которые являются делителями заданного числа.

// №3

// Даны два числа. Получите массив цифр, которые есть и в одном, и во втором числе.

// №4

// Дано число. Получите массив позицией всех цифр 3 в этом числе, за исключением первой и последней.

// №5

// Дан массив со числами. Оставьте в нем числа, состоящие из разных цифр, а остальные удалите.

// №6

// Дан массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]
// Слейте элементы этого массива в один одномерный массив:

// [1, 2, 3, 4, 5, 6, 7, 8, 9]










