//! =============================================

//; Уровень 3.1 задачника JavaScript

//! =============================================

//? №1
//? Дано некоторое число. Проверьте, что цифры этого числа расположены по возрастанию.

// const num = 1234586;
// const str = String(num).split('');
// let res = true;
// for (let i = 0; i < str.length - 1; i++) {
//   if (Number(str[i]) > Number(str[i + 1])) {
//       res = false;
//       break;
//   }
// }
// console.log(res);

//! =============================================

//? №2
//? Дан массив:
//? [1, '', 2, 3, '', 5]
//? Удалите из массива все пустые строки.

// const arr = [1, '', 2, 3, '', 5];
// const res = arr.filter(n => n !== '');
// console.log(res);

//! =============================================

//? №3
//? Дан массив:
//? [
//? 	[2, 1, 4, 3, 5],
//? 	[3, 5, 2, 4, 1],
//? 	[4, 3, 1, 5, 2],
//? ]
//? Отсортируйте элементы в каждом подмассиве.

// const arr = [
//     [2, 1, 4, 3, 5],
//     [3, 5, 2, 4, 1],
//     [4, 3, 1, 5, 2],
// ];
// const res = arr.map(n => n.toSorted((a, b) => a - b));
// console.log(res);

//! =============================================

//? №4
//? Даны два массива:
//? let arr1 = [1, 2, 3];
//? let arr2 = [1, 2, 3, 4, 5];
//? Удалите из большего массива лишние элементы с конца так, чтобы длины массивов стали одинаковыми.

// let arr1 = [1, 2, 3];
// let arr2 = [1, 2, 3, 4, 5];
// const res = arr2.slice(0, arr1.length);
// console.log(res);

//! =============================================

//; Уровень 3.2 задачника JavaScript

//! =============================================

//? №1
//? Выведите в консоль все числа в промежутке от 10 до 1000, у которых предпоследняя цифра четная.

// for (let i = 10; i <= 1000; i++) {
//     let str = String(i);
//     if (Number(str[str.length - 2]) % 2 === 0) {
//     console.log(i);
//     };
// };

//! =============================================

//? №2
//? Дан массив. Удалите из него каждый пятый элемент.

// const arr = [1, 2, 3, 4, 5, 1, 2, 3, 4, 5, 1, 2, 3, 4, 5];
// console.log(arr.filter((n, i) => (i + 1) % 5 !== 0));

//! =============================================

//? №3
//? Дана некоторая переменная с числом:
//? let num = 5;
//? Сделайте строку, содержащую столько нулей, сколько указано в переменной. В нашем случае получится такая строка:
//? '00000'

// let num = 5;
// console.log('0'.repeat(num));

//! =============================================

//? №4
//? Дана некоторая строка со словами:
//? 'aaa bbb ccc eee fff'
//? Удалите из этой строки каждое второе слово. В нашем случае должно получится следующее:
//? 'aaa ccc fff'

// const str = 'aaa bbb ccc eee fff';
// const res = str
//     .split(' ')
//     .filter((_, i) => i % 2 === 0)
//     .join(' ')
// console.log(res);

//! =============================================

//? №5
//? Дан массив:
//? [
//? 	[1, 2, 3],
//? 	[4, 5, 6],
//? 	[7, 8, 9],
//? ]
//? Найдите сумму элементов этого массива.

// const arr = [
//  	[1, 2, 3],
//  	[4, 5, 6],
//  	[7, 8, 9],
//  ]
// let sum = 0;
// const arr1 = arr
//     .flat()
//     .forEach(n => sum += n);
//     console.log(sum);

//! =============================================

//; Уровень 3.3 задачника JavaScript

//! =============================================

//? №1
//? Дан массив со словами. Удалите из него слова, состоящие более чем из трех символов.

// const arr = ['five', 'nice', 'place', 'ccc', 'eee', 'fff'];
// const res = arr.filter(n => n.length <= 3);
// console.log(res);

//! =============================================

//? №2
//? Дано некоторое число:
//? 1357
//? Проверьте, что все цифры этого числа являются нечетными.

// const num = 1357;
// console.log(String(num).split('').every(n => n % 2 !==0));

//! =============================================

//? №3
//? Дано некоторое слово:
//? 'abcba'
//? Проверьте, что это слово читается одинаково с любой стороны.

// const world = 'abcba';
// console.log(world === world.split('').reverse().join(''));

//! =============================================

//? №4
//? Дан массив:
//? [
//? 	[
//? 		[11, 12, 13],
//? 		[14, 15, 16],
//? 		[17, 17, 19],
//? 	],
//? 	[
//? 		[21, 22, 23],
//? 		[24, 25, 26],
//? 		[27, 27, 29],
//? 	],
//? 	[
//? 		[31, 32, 33],
//? 		[34, 35, 36],
//? 		[37, 37, 39],
//? 	],
//? ]
//? Найдите сумму элементов этого массива.

// const arr = [
// 	[
// 		[11, 12, 13],
// 		[14, 15, 16],
// 		[17, 17, 19],
// 	],
// 	[
// 		[21, 22, 23],
// 		[24, 25, 26],
// 		[27, 27, 29],
// 	],
// 	[
// 		[31, 32, 33],
// 		[34, 35, 36],
// 		[37, 37, 39],
// 	],
// ];
// console.log(arr.flat(2).reduce((sum, n) => sum += n, 0));

//! =============================================

//; Уровень 3.4 задачника JavaScript

//! =============================================

//? №1
//? Выведите в консоль все числа в промежутке от 10 до 1000, у которых первая цифра четная.

// for (let i = 10; i <= 1000; i++) {
//     if (Number(String(i)[0]) % 2 === 0) {
//         console.log(i);
//     };
// };

//! =============================================

//? №2
//? Дан некоторый массив, например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? Поменяйте местами пары элементов этого массива:
//? [2, 1, 4, 3, 6, 5]

// const arr = [1, 2, 3, 4, 5, 6];
// const resArr = [];
// for (let i = 0; i < arr.length; i += 2) {
//     if (arr[i + 1] !== undefined) {
// resArr.push(arr[i + 1])
//     resArr.push(arr[i])
//     } else {
//          resArr.push(arr[i])
//     }
// };
// console.log(resArr);

//! =============================================

//? №3
//? Дан следующий объект:
//? let obj = {
//? 	1: {
//? 		1: 11,
//? 		2: 12,
//? 		3: 13,
//? 	},
//? 	2: {
//? 		1: 21,
//? 		2: 22,
//? 		3: 23,
//? 	},
//? 	3: {
//? 		1: 24,
//? 		2: 25,
//? 		3: 26,
//? 	},
//? }
//? Найдите сумму элементов этого объекта.

// let obj = {
//  	1: {
//  		1: 11,
//  		2: 12,
//  		3: 13,
//  	},
//  	2: {
//  		1: 21,
//  		2: 22,
//  		3: 23,
//  	},
//  	3: {
//  		1: 24,
//  		2: 25,
//  		3: 26,
//  	},
//  }
//  let sum = 0;
// const arr = Object.values(obj).map(n => Object.values(n));
// arr.forEach((n) => n.forEach((m) => sum += m));
// console.log(sum);

//! =============================================

//; Уровень 3.5 задачника JavaScript

//! =============================================

//? №1
//? Дан текст со словами. Запишите в массив все слова, начинающиеся на букву 'a'.

// const text = 'A curious artist always asks amazing and ambitious questions';
// const strs = text.split(' ');
// const res = [];
// strs.forEach(n => {
//     if (n[0].toLowerCase() === 'a') {
// res.push(n);
//     }
// })
// console.log(res);

//! =============================================

//? №2
//? Дан массив с числами. Оставьте в нем только те числа, которые делятся на 5.

// const arr = [1, 10, 2, 15, 30, 4, 5, 6];
// const res = arr.filter(n => n % 5 === 0);
// console.log(res);

//! =============================================

//? №3
//? Дан массив с числами. Оставьте в нем только те числа, которые содержат цифру ноль.

// const arr = [1, 10, 2, 15, 30, 4, 103, 5, 6];
// const res = arr.filter(n => String(n).includes("0"));
// console.log(res);

//! =============================================

//? №4
//? Дан массив с числами. Проверьте, что в нем есть число, содержащее в себе цифру 3.

// const arr = [1, 10, 2, 15, 30, 4, 103, 5, 6]
// console.log(arr.some(n => String(n).includes("3")));

//! =============================================

//? №5
//? Дано некоторое число:
//? 35142
//? Отсортируйте цифры этого числа. В нашем случае должно получится следующее:
//? 12345

// const num = 35142;
// console.log(String(num).split('').toSorted((a, b) => a - b).join(''));

//! =============================================

//? №6
//? Напишите программу, которая сформирует следующую строку:
//? '-1-2-3-4-5-'

// let str = '';
// for (let i = 1; i <= 5; i++) {
// str += "-" + i;
// }
// console.log(str + "-");

//! =============================================

//? №7
//? Дан следующий объект:
//? let obj = {
//? 	1: {
//? 		1: {
//? 			1: 111,
//? 			2: 112,
//? 			3: 113,
//? 		},
//? 		2: {
//? 			1: 121,
//? 			2: 122,
//? 			3: 123,
//? 		},
//? 	},
//? 	2: {
//? 		1: {
//? 			1: 211,
//? 			2: 212,
//? 			3: 213,
//? 		},
//? 		2: {
//? 			1: 221,
//? 			2: 222,
//? 			3: 223,
//? 		},
//? 	},
//? 	3: {
//? 		1: {
//? 			1: 311,
//? 			2: 312,
//? 			3: 313,
//? 		},
//? 		2: {
//? 			1: 321,
//? 			2: 322,
//? 			3: 323,
//? 		},
//? 	},
//? }
//? Найдите сумму элементов этого объекта.

// let obj = {
// 	1: {
// 		1: {
// 			1: 111,
// 			2: 112,
// 			3: 113,
// 		},
// 		2: {
// 			1: 121,
// 			2: 122,
// 			3: 123,
// 		},
// 	},
// 	2: {
// 		1: {
// 			1: 211,
// 			2: 212,
// 			3: 213,
// 		},
// 		2: {
// 			1: 221,
// 			2: 222,
// 			3: 223,
// 		},
// 	},
// 	3: {
// 		1: {
// 			1: 311,
// 			2: 312,
// 			3: 313,
// 		},
// 		2: {
// 			1: 321,
// 			2: 322,
// 			3: 323,
// 		},
// 	},
// }
// const arr = Object.values(obj)
// .flatMap(n => Object.values(n))
// .flatMap(n => Object.values(n))
// .reduce((sum, n) => sum += n ,0)
// console.log(arr);

//! =============================================

//; Уровень 3.6 задачника JavaScript

//! =============================================

//? №1
//? Дан массив со числами. Удалите из него числа, состоящие более чем из трех цифр.

// const arr = [1, 1209, 2, 2150, 30, 4, 103, 5, 6];
// const res = arr.filter(n => String(n).length <= 3);
// console.log(res);

//! =============================================

//? №2
//? Дано число, например, вот такое:
//? let num = 12345;
//? Проверьте, что все цифры этого числа больше нуля.

// let num = 12345;
// console.log(String(num).split('').every(n => Number(n) > 0));

//! =============================================

//? №3
//? Дан некоторый массив, например, вот такой:
//? [123, 456, 789]
//? Слейте все элементы этого массива в один массив, разбив их посимвольно:
//? [1, 2, 3, 4, 5, 6, 7, 8, 9]

// const arr = [123, 456, 789];
// const res = [];
// arr.map(n => res.push(...String(n).split('')));
// const resTotal = res.map(n => Number(n))
// console.log(resTotal);

//! =============================================

//? №4
//? Дан следующая структура:
//? let data = [
//? 	{
//? 		1: 11,
//? 		2: 12,
//? 		3: 13,
//? 	},
//? 	{
//? 		1: 21,
//? 		2: 22,
//? 		3: 23,
//? 	},
//? 	{
//? 		1: 24,
//? 		2: 25,
//? 		3: 26,
//? 	},
//? ];
//? сумму элементов этой структуры.

// let data = [
// 	{
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	{
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	{
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// ];
// const res = data.flatMap(n => Object.values(n)).reduce((sum, m) => sum += m, 0);
// console.log(res);

//! =============================================

//; Уровень 3.7 задачника JavaScript

//! =============================================

//? №1
//? Дана строка со словами. Отсортируйте слова в алфавитном порядке.

// const str = "Life gets easier when you stop overthinking and just start doing";
// const res = str.split(' ').toSorted((a, b) => a.localeCompare(b));
// console.log(res);

//! =============================================

//? №2
//? Дано число. Получите массив делителей этого числа.

// const num = 125;
// const arr = [];
// for (let i = 1; i <= num; i++) {
//     if (num % i === 0) {
//         arr.push(i)
//     };
// };
// console.log(arr);

//! =============================================

//? №3
//? Даны два числа. Получите массив общих делителей этих чисел.

// const num1 = 20;
// const num2 = 400;
// const arr = [];
// for (let i = 1; i <= Math.min(num1, num2); i++) {
//     if (num1 % i === 0 && num2 % i === 0) {
//         arr.push(i)
//     };
// };
// console.log(arr);

//! =============================================

//? №4
//? Дано число. Проверьте, что у этого числа есть только один делитель, кроме него самого и единицы.

// const num = 17;
// const arr = [];
// for (let i = 2; i < num; i++) {
//     if (num % i === 0) {
//         arr.push(i);
//     };
// };
// console.log(arr.length === 1);

//! =============================================

//? №5
//? Через запятую написаны числа. Получите максимальное из этих чисел.

// console.log(Math.max(20, 10, 50, 40));

//! =============================================

//? №6
//? Дан массив с числами. После каждого однозначного числа вставьте еще такое же.

// const arr = [123, 12, 1, 456, 3, 789];
// const res = [];
//  arr.forEach(n => {
//     if (String(n).length > 1) {
//         res.push(n)
//     } 
//     if (String(n).length === 1) {
//       res.push(n);
//       res.push(n);
//     }
//  })
//  console.log(res);

//! =============================================

//? №7
//? Дана строка. Удалите из нее все гласные буквы.

// const str = 'строка';
// const vowels = ['а', 'е', 'є', 'и', 'і', 'ї', 'о', 'у', 'ю', 'я'];
// const res = str.split('').filter(n => !vowels.includes(n));
// console.log(res.join(''));

//! =============================================

// №8

// Дана строка. Сделайте заглавной последнюю букву каждого слова в этой строке.

// №9

// Дан следующая структура:

// let data = [
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// 	{
// 		1: [1, 2, 3],
// 		2: [1, 2, 3],
// 		3: [1, 2, 3],
// 	},
// ];
// Найдите сумму элементов этой структуры.



// Уровень 3.8 задачника JavaScript
// №1

// Дан массив со числами. Проверьте, что все числа из этого массива содержат в себе цифру 3.

// №2

// Дана строка в формате:

// 'kebab-case'
// Преобразуйте ее в формат:

// 'snake_case'
// №3

// Дана строка в формате:

// 'snake_case'
// Преобразуйте ее в формат:

// 'camelCase'
// №4

// Дана строка в формате:

// 'camelCase'
// Преобразуйте ее в формат:

// 'snake_case'
// №5

// Сформируйте с помощью циклов следующий массив:

// [
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// 	[1, 2, 3],
// ]






// Уровень 3.9 задачника JavaScript
// №1

// Дана строка. Проверьте, что эта строка состоит только из цифр.

// №2

// Дана строка. Проверьте, что эта строка состоит только из четных цифр.

// №3

// Дан массив со числами. Удалите из него числа, имеющие два и более нуля.

// №4

// Найдите все числа от 1 до 1000, сумма цифр которых равна 13.

// №5

// Сформируйте с помощью циклов следующий массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]






// Уровень 3.10 задачника JavaScript
// №1

// Дан массив. Сделайте так, чтобы в нем каждый элемент повторился два раза.

// №2

// Дан массив и число. Оставьте в массиве только те числа, которые являются делителями заданного числа.

// №3

// Даны два числа. Получите массив цифр, которые есть и в одном, и во втором числе.

// №4

// Дано число. Получите массив позицией всех цифр 3 в этом числе, за исключением первой и последней.

// №5

// Дан массив со числами. Оставьте в нем числа, состоящие из разных цифр, а остальные удалите.

// №6

// Дан массив:

// [
// 	[1, 2, 3],
// 	[4, 5, 6],
// 	[7, 8, 9],
// ]
// Слейте элементы этого массива в один одномерный массив:

// [1, 2, 3, 4, 5, 6, 7, 8, 9]










