// Уровень 10.1 задачника JavaScript
// №1

// Сделайте функцию, которая параметром будет принимать английское существительное в единственном числе и возвращать его во множественном числе.

// №2

// Сделайте так, чтобы при клике на любое место окна браузера в месте клика появлялся порядковый номер этого клика.

// №3

// Дан текст со знаками препинаний:

// 'aaa bbb, ccc. Xxx - eee bbb, kkk!'
// Получите массив слов из такого текста.

// №4

// Дан инпут. По мере ввода в него числа он должен отделять тройки чисел пробелами.

// №5

// Даны два числа. Выведите на экран процесс умножения этих чисел в столбик, как в школе.

// №6

// Сделайте блок, который будет выезжать сверху экрана по нажатию на кнопку.





// Уровень 10.2 задачника JavaScript
// №1

// Дана таблица. При клике на ячейку она активируется каким-нибудь цветом. Сделайте так, чтобы ячейки вокруг активированной не активировались.

// №2

// Дана таблица. Сделайте так, чтобы каждую секунду активировалась случайная ячейка таблицы. Одна ячейка не может быть активной два раза подряд.

// №3

// Дан текстареа. Как известно, его размер можно менять, потянув за уголок. Сделайте так, чтобы можно было изменить размер этого текстареа, а затем обновить страницу - и изменения не должны пропасть.

// №4

// Дан инпут и кнопка. По клику на кнопку выведите список список ul всех избыточных чисел из промежутка, заданном значениями инпутов.

// №5

// Дана квадратная HTML таблица произвольного размера. По нажатию на кнопку заполните половину таблицу следующим образом:



// +	+	+	+	+
// +	+	+	+	
// +	+	+		
// +	+			
//     +		
    
//     https://code.mu/ru/javascript/tasker/stager/10/2/







//     Уровень 10.3 задачника JavaScript
// №1

// Сделайте инпут, в который можно ввести только числа. Остальные символы не должны вводится в инпут.

// №2

// Дан блок. По клику на блок покажите всплывающую подсказку с некоторым достаточно длинным текстом. Покажите подсказку или сверху или снизу с учетом того, чтобы она целиком поместилась на экране и не ушла под прокрутку.

// №3

// Дан массив из шести цифр. Проверьте, можно ли собрать из этих цифр счастливый билет.

// №4

// Дана прямоугольная таблица. По нажатию на кнопку покрасьте ячейки одной диагонали в красный цвет, а второй диагонали - в зеленый.

// №5

// Напишите код, который будет генерировать пароль заданного размера. Пароль обязательно должен будет содержать маленькую и большую буквы, цифру и какой-то специальный символ.

// №6

// Дано окно браузера. Сделайте так, чтобы элементы, целиком находящиеся в левой половине окна покрасились в зеленый цвет, целиком находящиеся в правой половине окна - в синий, а находящиеся и там, и там - в красный.

// №7

// Даны два числа. Выведите на экран процесс деления этих чисел в столбик, как в школе.

// №8

// Дана строка, содержащая два числа и математическую операцию между ними:

// '10 + 20'
// Напишите код, который вычислит результат записанной математической операции.






// Уровень 10.4 задачника JavaScript
// №1

// Дан текст со словами. Перемешайте все слова этого текста в случайном порядке.

// №2

// Выведите на страницу обратный отсчет дней, часов, минут и секунд, оставшихся до Нового Года.

// №3

// Даны два числа. Выведите на экран процесс нахождения НОК, как в школе.

// №4

// Даны два числа. Выведите на экран процесс нахождения НОД, как в школе.

// №5

// Дана HTML таблица, в которой в произвольных двух ячейках стоят плюсы:


// https://code.mu/ru/javascript/tasker/stager/10/4/


// По нажатию на кнопку заполните минусами все ячейки между заданными следующим образом:


// https://code.mu/ru/javascript/tasker/stager/10/4/



// Уровень 10.5 задачника JavaScript
// №1

// На странице юзер выделяет текст. По нажатию Ctrl + Enter запишите этот текст в буфер обмена.

// №2

// Дан текстареа. В него вводится текст. По нажатию клавиши Tab вставьте в место моргания курсора символ табуляции.

// №3

// Даны инпуты. В любой инпут можно ввести текст и нажать Enter. После этого текст из инпута исчезает. Сделайте так, чтобы каждый инпут запоминал введенные тексты. Над каждым инпутом разместите стрелочки, с помощью которых можно будет возвращать предыдущий введенный текст в инпут.

// №4

// Дано число. Выведите на экран процесс разложения числа на простые множители, как в школе.

// №5

// Дан многомерный объект произвольного уровня вложенности:

// {
// 	a: {
// 		b: {
// 			c: '+++'
// 		}
// 	},
// }
// Сделайте функцию, которая будет возвращать элементы объекта, параметром получая строку с ключами объекта, разделенными точками:

// func('a.b.c'); // вернет '+++'
// №6

// Дана таблица. По нажатию на кнопку заполните ее следующим образом:

// https://code.mu/ru/javascript/tasker/stager/10/5/



// Уровень 10.6 задачника JavaScript
// №1

// Дан инпут. Сделайте так, чтобы при вводе в него слова 'blur' этот инпут терял фокус.

// №2

// Дана таблица. По очереди выведите в нее все фигурки тетриса так, чтобы начало фигуры было в центре таблицы.

// №3

// Модифицируйте предыдущую задачу так, чтобы рядом с таблицей были кнопки, с помощью которых фигуры можно будет вращать.

// №4

// Сделайте скрипт, генерирующий квадратные уравнения с целыми корнями.

// №5

// Дан текстареа. В нем записан текст. Юзер выделяет несколько строк текста и нажимает клавишу Tab. Сделайте так, чтобы в начало каждой выделенной строки вставилась табуляция.

// №6

// Дана строка, содержащая в себе любое количество вложенных парных круглых скобок. Напишите код, который проверит, что скобки расположены корректно.

// Так корректно:

// '()()'
// Так корректно:

// '(())'
// Так некорректно, так как количество открытых скобок не совпадает с количеством закрытых:

// '())'
// Так некорректно, так как, хотя количество открытых скобок и совпадает с количеством закрытых, но у них неправильный порядок:

// '))(('




// Уровень 10.7 задачника JavaScript
// №1

// Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одном ряду таблицы можно было активировать не более 5-ти ячеек.

// №2

// Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в одной колонке таблицы можно было активировать не более 5-ти ячеек.

// №3

// Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы для активированной ячейки нельзя было активировать ее соседей слева и справа.

// №4

// Дана таблица. По клику на любую ячейку эта ячейка выделяется каким-то цветом, активируюясь. Сделайте так, чтобы в для активированной ячейки нельзя было активировать ее соседей сверху и снизу.

// №5

// Дана инпут. В него вводится длинное слово. Выведите список слов, которые можно составить из букв введенного в инпут слова.

// №6

// Дан текстареа. В нем записан текст. Юзер выделяет несколько строк текста и нажимает клавишу Alt + Tab. Сделайте так, чтобы из начала каждой выделенной строки удалилась табуляция.

// №7

// Дана строка, содержащая две дроби и математическую операцию между ними:

// '2/3 + 3/4'
// Напишите код, который вычислит результат записанной математической операции.





// Уровень 10.8 задачника JavaScript
// №1

// Дан массив. Выведите в консоль все варианты перестановки элементов этого массива.

// №2

// Напишите код, который нарисует радугу на канвасе.

// №3

// Даны два инпута и кнопка. По клику на кнопку выведите список список ul всех дружественных чисел из промежутка, заданном значениями инпутов.

// №4

// Дана форма с инпутами, текстареа, чебоксами, радиокнопками и селектами. Юзер как-то изменяет элементы формы. Сделайте так, чтобы после перезагрузки окна браузера все элементы формы пришли в то состояние, в котором их оставил юзер.

// №5

// Дана квадратная HTML таблица произвольного размера. По нажатию на кнопку транспонируйте ее, то есть завалите ее на бок. Посмотрим на примере. Пусть у нас есть вот такая таблица:

// https://code.mu/ru/javascript/tasker/stager/10/8/

// После транспонирования она должна превратится в следующую:


// https://code.mu/ru/javascript/tasker/stager/10/8/




// Уровень 10.9 задачника JavaScript
// №1

// Напишите код, который нарисует стрелку на канвасе. Острие стрелки должно указывать в заданную точку, а сама стрелка должна быть наклонена под заданным углом.

// №2

// Дан див, текстом которого является некоторый CSS код. Напишите скрипт, который выполнит подсветку синтаксиса этого кода.

// №3

// При заходе на страницу сайта покажите юзеру обратный отсчет, который закончится через час от момента захода юзера на сайт. Сделайте так, чтобы после обновления страницы, отсчет продолжался с того места, на котором он остановился.

// №4

// Напишите код, который сгенерирует таблицу, в которой случайным образом будут расставлены корабли для игры в морской бой.

// №5

// Дана HTML таблица, в которой в произвольных двух ячейках стоят плюсы:


// https://code.mu/ru/javascript/tasker/stager/10/9/


// По нажатию на кнопку заполните минусами все ячейки вокруг заданных следующим образом:


// https://code.mu/ru/javascript/tasker/stager/10/9/








// Уровень 10.10 задачника JavaScript
// №1

// Дана строка, содержащая в себе дробь:

// '12/16'
// Напишите код, который распишет процесс сокращения дроби, как в школе:

// '12/16 = 6/8 = 3/4'
// №2

// Реализуйте алгоритм "Решето Эратосфена" для поиска простых чисел в заданном промежутке.

// №3

// Напишите код, который выведет на канвасе тикающие стрелочные часы, показывающие текущее время.

// №4

// Дана квадратная HTML таблица с четным количеством рядом и колонок. По нажатию на кнопку заполните центр таблицы следующим образом:


// https://code.mu/ru/javascript/tasker/stager/10/10/








