//* ==================================================================================================

//! Задача №1.1 / 1
//? Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.

// const randomNumber = Math.round(Math.random() * 2001) - 1000;
// if (randomNumber < 0) {
//   console.log(`${randomNumber} - число отрицательное`);
// } else if (randomNumber > 0) {
//   console.log(`${randomNumber} - число положительное`);
// } else {
//   console.log(`${randomNumber} - не имеет знака`);
// }

//* ==================================================================================================

//! Задача №№1.1 / 2
//? Дана строка. Выведите в консоль длину этой строки.

// const text = 'Выведите в консоль длину этой строки';
// console.log(text.length);

//* ==================================================================================================

//! Задача №1.1 / 3
//? Дана строка. Выведите в консоль последний символ строки.

// const text = 'Выведите в консоль последний символ строки';
// console.log(text[text.length - 1]);

//* ==================================================================================================

//! Задача №1.1 / 4
//? Дано число. Проверьте, четное оно или нет.

// const randomNumber = Math.round(Math.random() * 1001);
// if (randomNumber % 2 === 0) {
//   console.log(`Число ${randomNumber} - четное`);
// } else {
//   console.log(`Число ${randomNumber} - нечетное`);
// }

//* ==================================================================================================

//! Задача №1.1 / 5
//? Даны два слова. Проверьте, что первые буквы этих слов совпадают.

// const word1 = prompt('Введіть перше слово:');
// const word2 = prompt('Введіть друге слово:');
// if (word1[0] === word2[0]) {
//   alert('Первые буквы совпадают');
// } else {
//   alert('Первые буквы не совпадают');
// }

//* ==================================================================================================

//! Задача №1.2 / 1
//? Дано число. Выведите в консоль первую цифру этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// console.log(String(randomNumber)[0]);

//* ==================================================================================================

//! Задача №1.2 / 2
//? Дано число. Выведите в консоль последнюю цифру этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// const numberString = String(randomNumber);
// console.log(randomNumber);
// console.log(numberString.slice(-1));

//* ==================================================================================================

//! Задача №1.2 / 3
//? Дано число. Выведите в консоль сумму первой и последней цифры этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// const number1 = Number(String(randomNumber)[0]);
// const number2 = Number(String(randomNumber).slice(-1));
// console.log(randomNumber);
// console.log(number1 + number2);

//* ==================================================================================================

//! Задача №1.2 / 4
//? Дано число. Выведите количество цифр в этом числе.

// const randomNumber = Math.round(Math.random() * 1001);
// console.log(randomNumber);
// console.log(String(randomNumber).length);

//* ==================================================================================================

//! Задача №1.2 / 5
//? Даны два числа. Проверьте, что первые цифры этих чисел совпадают.

// const randomNumber1 = Math.round(Math.random() * 1001);
// const randomNumber2 = Math.round(Math.random() * 1001);
// console.log(randomNumber1, randomNumber2);
// if (String(randomNumber1)[0] === String(randomNumber2)[0]) {
//   console.log(
//     `первые цифры чисел ${randomNumber1} и ${randomNumber2} совпадают`
//   );
// } else {
//   console.log(
//     `первые цифры чисел ${randomNumber1} и ${randomNumber2} НЕ совпадают`
//   );
// }

//* ==================================================================================================

//! Задача №1.3 / 1
//? Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

// const string = prompt('Введите слово или предложение:');
// const str = String(string).slice(-2, -1);
// if (str) {
//   alert(`предпоследний символ этой строки это "${str}`);
// } else {
//   alert('Данна страка имеет один символ');
// }

//* ==================================================================================================

//! Задача №1.3 / 2
//? Даны два целых числа. Проверьте, что первое число без остатка делится на второе.

// const randomNumber1 = Math.round(Math.random() * 901) + 100;
// const randomNumber2 = Math.round(Math.random() * 100) + 1;
// const quotient = randomNumber1 % randomNumber2;
// console.log(randomNumber1, randomNumber2);
// if (quotient === 0) {
//   console.log('Первое число без остатка делится на второе');
// } else {
//   console.log(`Первое число делится на второе с остатком ${quotient}`);
// }

//* ==================================================================================================

//! Задача №1.4 / 1
//? Выведите в консоль все целые числа от 1 до 100.

// for (let i = 1; i <= 100; i++) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 2
//? Выведите в консоль все целые числа от -100 до 0.

// for (let i = -100; i <= 0; i++) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 3
//? Выведите в консоль все целые числа от 100 до 1.

// for (let i = 100; i >= 1; i--) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 4
//? Выведите в консоль все четные числа из промежутка от 1 до 100.

// for (let i = 2; i <= 100; i += 2) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 5
//? Выведите в консоль все числа кратные трем в промежутке от 1 до 100.

// for (let i = 3; i <= 100; i += 3) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.5 / 1
//? Найдите сумму всех целых чисел от 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//   sum += i;
// }
// console.log(sum);

//* ==================================================================================================

//! Задача №1.5 / 2
//? Найдите сумму всех целых четных чисел в промежутке от 1 до 100.

// let sum = 0;
// for (let i = 2; i <= 100; i += 2) {
//   sum += i;
// }
// console.log(sum);

//* ==================================================================================================

//! Задача №1.5 / 3
//? Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i += 2) {
//   sum += i;
// }
// console.log(sum);

//* =================================================================================================

//! Задача №1.5 / 4
//? Даны два целых числа. Найдите остаток от деления первого числа на второе.

// const randomNumber1 = Math.round(Math.random() * 901) + 100;
// const randomNumber2 = Math.round(Math.random() * 100) + 1;
// const quotient = randomNumber1 % randomNumber2;
// console.log(randomNumber1, randomNumber2);
// console.log(quotient);

//* =================================================================================================

//! Задача №1.5 / 5
//? Дана некоторая строка. Переберите и выведите в консоль по очереди все символы с конца строки.

// const string = prompt('Введите слово или предложение:');
// for (let i = string.length - 1; i >= 0; i--) {
//   console.log(string[i]);
// }

//* =================================================================================================

//! Задача №1.6 / 1
//? Дан массив с числами. Найдите сумму квадратов элементов этого массива.
