// Уровень 5.1 задачника JavaScript
// №1

// Даны два инпута, абзац и кнопка. В инпуты вводятся числа. По нажатию на кнопку выведите в абзац сумму этих чисел.

// №2

// Дан абзац с числом и кнопка. По нажатию на кнопку возведите текст абзаца в квадрат.

// №3

// Дан абзацы с числами, абзац и кнопка. По нажатию на кнопку найдите сумму значений абзацев и запишите ее в абзац.

// №4

// Даны абзацы с числами. Сделайте так, чтобы по клику на любой абзац его значение возводилось в квадрат.

// №5

// Даны инпуты, в которые вводятся числа.Сделайте так, чтобы по потери фокуса в любом инпуте его значение возводилось в квадрат.



// Уровень 5.2 задачника JavaScript
// №1

// Дан абзац и кнопка. По нажатию на кнопку найдите сумму чисел от 1 до 100 и запишите результат в абзац.

// №2

// Дана кнопка и два инпута. В инпуты вводятся числа. По нажатию на кнопку найдите сумму введенных чисел.

// №3

// Даны абзацы, кнопка и див. По нажатию на кнопку найдите количество абзацев и выведите это значение в див.

// №4

// Дана кнопка и инпут.В инпут вводится строка.По нажатию на кнопку определите, сколько символов в введенной строке.



// Уровень 5.3 задачника JavaScript
// №1

// Дан абзац, инпут и кнопка. В инпут вводится число. По нажатию на кнопку выведите в абзац факториал введенного числа.

// №2

// Даны два инпута, кнопка и абзац. В инпуты вводятся целые числа. Определите, какое из введенных чисел больше и выведите его в абзац.

// №3

// Дана кнопка и инпут. В инпут вводится число. По нажатию на кнопку найдите сумму цифр введеного числа.

// №4

// Дан абзац, инпут и кнопка. В инпут вводится слово. По нажатию на кнопку переверните слово и запишите его в абзац.

// №5

// Даны пустые абзацы и кнопка. По нажатию на кнопку заполните абзацы числами по порядку.

// №6

// Дан инпут, абзац и кнопка.В инпут вводится число.По клику на кнопку выведите в абзац факториал этого числа.





// Уровень 5.4 задачника JavaScript
// №1

// Даны абзацы с текстом. Сделайте так, чтобы по нажатию на любой абзац его текстом становилось значение '!'.

// №2

// Даны ссылки и кнопка. По нажатию на кнопку получите массив атрибутов href ссылок.

// №3

// Дан абзац и кнопка. По нажатию на кнопку сделайте в цикле строку '123456789' и запишите ее в абзац.

// №4

// Даны три абзаца. Выведите в первый текущий год, во второй - текущий месяц, в третий - текущий день.

// №5

// Дана ссылка, абзац и кнопка.По нажатию на кнопку запишите href ссылки в текст абзаца.


// Уровень 5.5 задачника JavaScript
// №1

// Дан инпут, кнопка и три абзаца. В инпут вводится дата в формате 2025-12-31. По нажатию на кнопку выведите в первый абзац год, во второй абзац - месяц, в третий день.

// №2

// Даны два инпута и кнопка. В инпуты вводятся числа. По нажатию на кнопку заполните массив целыми числами от первого введеного числа до последнего.

// №3

// Дан инпут, абзац и кнопка. В инпут вводится строка. По нажатию на кнопку выведите в абзац последний символ введенной строки.

// №4

// Дан абзац, в котором записано число 1. По нажатию на кнопку увеличивайте число в абзаце на единицу.

// №5

// Дан инпут и абзац.В инпут вводится строка со словами.По потери фокуса выведите в абзац количество слов во введенной строке.




// Уровень 5.6 задачника JavaScript
// №1

// Дан инпут, кнопка и абзац. В инпут вводится год. По нажатию на кнопку определите, введен високосный год или нет и выведите информацию об этом в абзац.

// №2

// Дан инпут и кнопка. По нажатию на кнопку выведите в инпут случайное число из диапазона от 1 до 100.

// №3

// Дан инпут, кнопка и абзац. В инпут вводится дата в формате 2025-12-31. По нажатию на кнопку выведите в абзац день недели, соответствующий этой дате.

// №4

// Дан див с шириной, высотой и границей, и кнопка. По клику на кнопку увеличьте размеры дива в два раза.

// №5

// Даны ссылки.Сделайте так, чтобы по наведению на любую ссылку над ней появлялось значение ее атрибута href.



// Уровень 5.7 задачника JavaScript
// №1

// Даны теги li с числами, инпут и кнопка. По нажатию на кнопку найдите сумму чисел и выведите их в инпут.

// №2

// Даны теги li с числами и кнопка. По нажатию на кнопку увеличьте все числа в тегах li на единицу.

// №3

// Дан инпут, абзац и кнопка. В инпут вводится число. По нажатию на кнопку получите массив делителей числа и выведите их в абзац через запятую.

// №4

// Даны абзацы с текстом. Сделайте так, чтобы по нажатию на любой абзац его текст переворачивался.

// №5

// В инпут вводится число из 6 - ти цифр.По нажатию на кнопку проверьте, равна ли сумма первых трех цифр сумме вторых трех цифр.




// Уровень 5.8 задачника JavaScript
// №1

// Даны инпуты. В них вводятся числа. Сделайте так, чтобы при потери фокуса в любом из инпутов в нем появлялся квадрат введенного в него числа.

// №2

// Дан массив, кнопка и инпут. Сделайте так, чтобы по клику на кнопку в инпут выводился случайный элемент массива.

// №3

// Дан инпут и абзац. В него через запятую вводятся числа. По потери фокуса найдите сумму введенных чисел и выведите ее в абзац.

// №4

// Даны два инпута и кнопка. В инпуты вводятся числа. По нажатию на кнопку получите массив общих делителей этих чисел и выведите его в консоль.

// №5

// Дан инпут и кнопка. В инпут через запятую вводятся числа. По нажатию на кнопку проверьте, есть ли среди введенных число 13.

// №6

// Дан инпут и кнопка.В него вводится число из шести цифр.По клику на кнопку проверьте, что число представляет собой счастливый билет, то есть сумма первых трех цифр равна сумме вторых трех цифр.




// Уровень 5.9 задачника JavaScript
// №1

// Дан массив с числами, кнопка и инпут. По нажатию на кнопку запишите в инпут все числа из массива, разделив их запятыми.

// №2

// Даны абзацы с текстом. Сделайте так, чтобы по нажатию на любой абзац его текст красился в красный цвет.

// №3

// Дан инпут. В него вводится число. Если введено нечетное число, то покрасьте границу инпута в красный цвет, а если четное - то в зеленый.

// №4

// В инпут вводится дата в формате 2025-12-31. По потери фокуса сделайте так, чтобы в инпуте стала дата в формате 35.12.2025.

// №5

// Дан пустой список ul и текстареа.В него вводится текст со знаками препинания.По потери фокуса запишите каждое предложение из текста в свой тег li.






// Уровень 5.10 задачника JavaScript
// №1

// Дан инпут. В него вводится число. Если введено нечетное число, то покрасьте границу инпута в красный цвет, а если четное - то в зеленый.

// №2

// Дан массив с числами и кнопка. По нажатию на кнопку добавьте в массив случайное число и выведите массив в консоль.

// №3

// Дан массив с названиями цвета. Даны абзацы с текстом. Сделайте так, чтобы по нажатию на любой абзац его текст красился в случайный цвет из массива.

// №4

// Дан массив с числами, кнопка и абзац. Сделайте так, чтобы по клику на кнопку в инпут через запятую выводились четные числа из этого массива.

// №5

// Дана кнопка и див. По нажатию на кнопку выведите, сколько дней осталось до Нового Года.

// №6

// Дана кнопка и ul. По клику на кнопку выведите список всех годов за сто лет назад и вперед.