// Уровень 7.1 задачника JavaScript
// №1

// Дана кнопка и список ul, заполненный числами. По клику на кнопку удалите пункт списка, содержащий самое максимальное число.

// №2

// Дан абзац, содержащий текст со словами. Дана также кнопка. По клику на кнопку возьмите каждое слово в свой тег span.

// №3

// Дан абзац, содержащий текст со словами и с дробями вида 1/2. Дана также кнопка. По клику на кнопку возьмите каждую дробь в свой тег span.

// №4

// Дана таблица и инпут. В инпут вводится дата рождения юзера в формате год-месяц-день. Выведите в первой колонке все даты рождения юзера, а во второй колонке - соответствующие дни недели.

// №5

// Напишите программу, которая сформирует следующий массив:

// [
// 	[
// 		[1, 2, 3],
// 		[1, 2, 3],
// 		[1, 2, 3],
// 	],
// 	[
// 		[1, 2, 3],
// 		[1, 2, 3],
// 		[1, 2, 3],
// 	],
// 	[
// 		[1, 2, 3],
// 		[1, 2, 3],
// 		[1, 2, 3],
// 	],
// ]






// Уровень 7.2 задачника JavaScript
// №1

// Дан список ul с числами, инпут и кнопка. В инпут вводится число. По клику на кнопку покрасьте в красный цвет li, содержащее введенное число.

// №2

// Дан инпут. В него вводится год. Выведите даты всех пятниц 13-е заданного года в виде списка ul.

// №3

// Даны чекбоксы, с помощью которых у юзера спрашиваются языки, которые он знает. Дан также абзац. По мере выбора чекбоксов юзером выводите в абзац выбранные языки через запятую.

// №4

// Напишите программу, которая сформирует следующий массив:

// [
// 	['x'],
// 	['x', 'x'],
// 	['x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x', 'x'],
// ]
// №5

// Дан следующая верстка:

// <p>111</p>
// <p>222</p>
// <p>333</p>
// <p>444</p>
// <p>555</p>
// Получите содержимое текстов абзацев в виде массива:

// [
// 	'111',
// 	'222',
// 	'333',
// 	'444',
// 	'555',
// ]


// Уровень 7.3 задачника JavaScript
// №1

// Дан абзац, содержащий текст со словами. Некоторые слова повторяются два раза. По клику на кнопку удалите лишние одинаковые рядом стоящие слова.

// №2

// Сделайте функцию, которая будет возвращать массив, заполненный N случайными числами из заданного диапазона так, чтобы числа не повторялись.

// №3

// Дан следующая структура данных:

// let data = [
// 	{
// 		text: '111',
// 		href: '1.html',
// 	},
// 	{
// 		text: '222',
// 		href: '2.html',
// 	},
// 	{
// 		text: '333',
// 		href: '3.html',
// 	},
// ]
// Сформируйте с помощью этих данных следующую верстку:

// <a href="1.html">111</a>
// <a href="2.html">222</a>
// <a href="3.html">222</a>




// Уровень 7.4 задачника JavaScript
// №1

// Дан ul. Выведите в него дни текущего месяца. Текущий день, а также выходные, выделите другими цветами.

// №2

// Дан абзац, содержащий текст со словами. Сделайте так, чтобы по клику на любое слово из этого абзаца, это слово выделялось красным цветом.

// №3

// Дан инпут и кнопка. В него вводится число из четного количества цифр. По клику на кнопку проверьте, что число представляет собой счастливый билет, то есть сумма половины цифр равна сумме второй половине цифр.

// №4

// Дан инпут. В него вводится текст. Сделайте так, чтобы в инпут нельзя было ввести больше десяти символов. При превышении количества, символы просто не должны вводиться.

// №5

// Дан инпут, абзац и кнопка. В инпут вводится число. По нажатию на кнопку сделайте так, чтобы в абзаце начал тикать обратный отсчет от введенного в инпут числа до нуля.

// №6

// Напишите программу, которая сформирует следующий массив:

// [
// 	[1],
// 	[1, 2],
// 	[1, 2, 3],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5, 6],
// ]





// Уровень 7.5 задачника JavaScript
// №1

// Дана кнопка. По клику на кнопку плавно прокрутите окно браузера до самого низа.

// №2

// Даны кнопки и дивы. Каждая кнопка соответствует своему диву. Сделайте так, чтобы по первому клику на кнопку открывался ее див, а по второму клику - скрывался.

// №3

// Сделайте функцию, которая будет принимать строку на русском языке, а возвращать ее транслит.

// №4

// Напишите программу, которая сформирует следующий массив:

// [
// 	['x', 'x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x'],
// 	['x', 'x'],
// 	['x'],
// ]



// Уровень 7.6 задачника JavaScript
// №1

// На странице через абсолютное позиционирование расположены два дива. По клику на кнопку проверьте, накладываются ли эти дивы друга на друга или нет.

// №2

// Дана кнопка и ul. По клику на кнопку выведите список всех возможных счастливых билетов. Билет представляет собой строку из шести цифр, может быть с нулями спереди. Билет считается счастливым, если сумма сумма первых трех цифр равна сумме вторых трех цифр.

// №3

// Напишите программу, которая сформирует следующий массив:

// [
// 	'x',
// 	'xx',
// 	'xxx',
// 	'xxxx',
// 	'xxxxx',
// ]
// №4

// Дан такой объект:

// let data = {
// 	2018: {
// 		11: {
// 			29: [1, 2, 3],
// 			30: [4, 5],
// 		},
// 		12: {
// 			30: [6, 7],
// 			31: [8, 9],
// 		},
// 	},
// 	2019: {
// 		12: {
// 			29: [10, 11],
// 			30: [12, 13],
// 			31: [14, 15],
// 		}
// 	},
// }
// Запишите все элементы этого объекта в какой-нибудь массив, вот так:

// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]






// Уровень 7.7 задачника JavaScript
// №1

// Дан массив с числами. Подсчитайте общее количество цифр 3 во всех числах данного массива.

// №2

// Напишите программу, которая сформирует следующий массив:

// [
// 	'1',
// 	'12',
// 	'123',
// 	'1234',
// 	'12345',
// ]
// №3

// Дан массив:

// let affairs = [
// 	{
// 		date:  '2019-12-29',
// 		event: 'name1',
// 	},
// 	{
// 		date:  '2019-12-31',
// 		event: 'name2',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name3',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name4',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name5',
// 	},
// 	{
// 		date:  '2019-12-31',
// 		event: 'name6',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name7',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name8',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name9',
// 	},
// ]
// Получите из этого массива уникальные даты, то есть вот так:

// ['2019-12-29', '2019-12-30', '2019-12-31']





// Уровень 7.8 задачника JavaScript
// №1

// Дана кнопка и список ul. По клику на кнопку добавьте в конец каждой li ссылку, по нажатию на которую текст li будет перечеркиваться (но не текст ссылки).

// №2

// Дан абзац, содержащий текст со словами. Сделайте так, чтобы по клику на любое слово из этого абзаца, это слово меняло порядок своих букв на обратный.

// №3

// Дан следующий массив:

// let users = [
// 	{id: 1, name: 'user1', surn: 'surn1', age: 30},
// 	{id: 2, name: 'user2', surn: 'surn2', age: 31},
// 	{id: 3, name: 'user3', surn: 'surn3', age: 32},
// ];
// Выведите элементы этого массива в виде таблицы table так, чтобы каждое поле объекта попало в свой тег td. Сделайте заголовки колонок вашей таблицы.

// №4

// Напишите программу, которая сформирует следующий массив:

// [
// 	'1',
// 	'12',
// 	'123',
// 	'1234',
// 	'12345',
// 	'1234',
// 	'123',
// 	'12',
// 	'1',
// ]





// Уровень 7.9 задачника JavaScript
// №1

// Дан абзац и инпут. В абзаце через пробел написаны слова. В инпут вводится некоторое слово. По потери фокуса проверьте, есть ли такое слово в абзаце, и если нет - добавьте его.

// №2

// Напишите программу, которая сформирует следующую строку:

// '-1-12-23-34-45-'
// №3

// Напишите программу, которая сформирует следующий массив:

// [
// 	12,
// 	34,
// 	56,
// 	78,
// 	90,
// ]
// №4

// Дан следующая верстка:

// <a href="1.html">111</a>
// <a href="2.html">222</a>
// <a href="3.html">222</a>
// Получите содержимое адресов и текстов ссылок в виде следующей структуры:

// [
// 	{
// 		text: '111',
// 		href: '1.html',
// 	},
// 	{
// 		text: '222',
// 		href: '2.html',
// 	},
// 	{
// 		text: '333',
// 		href: '3.html',
// 	},
// ]




// Уровень 7.10 задачника JavaScript
// №1

// Напишите программу, которая сформирует следующую строку:

// '-x-xx-xxx-xx-x-'
// №2

// Напишите программу, которая сформирует следующую строку:

// '11 12 13 21 22 23 31 32 33'
// №3

// Даны дивы с названиями продуктов и ценами. Дан также абзац. Сделайте так, чтобы кликами можно было выбрать несколько продуктов и их суммарная стоимость при этом писалась бы в абзац.

// №4

// Дана таблица прямоугольного размера с нечетным количеством рядов и колонок.Дана кнопка.По клику на кнопку выделите каким - нибудь цветом центральную ячейку.









