// Уровень 2.1 задачника JavaScript
// №1

// Дана некоторая строка. Найдите позицию первого нуля в строке.

// №2

// Выведите в консоль все числа в промежутке от 1 до 1000, сумма первой и второй цифры которых равна пяти.

// №3

// Дан массив. Удалите из него элементы с заданным значением.

// №4

// Дан некоторый массив, например, вот такой:

// [1, 2, 3, 4, 5, 6]
// Найдите сумму первой половины элементов этого массива.

// Уровень 2.2 задачника JavaScript
// №1

// Дан массив с числами. Подсчитайте количество отрицательных чисел в этом массиве.

// №2

// Дан массив с числами. Оставьте в нем только положительные числа.

// №3

// Дана строка. Удалите предпоследний символ из этой строки.

// №4

// Дан некоторый массив, например, вот такой:

// [1, 2, 3, 4, 5, 6]
// Поделите сумму первой половины элементов этого массива на сумму второй половины элементов.


// Уровень 2.3 задачника JavaScript
// №1

// Даны два слова. Проверьте, что последняя буква первого слова совпадает с первой буквой второго слова.

// №2

// Дана некоторая строка. Найдите позицию третьего нуля в строке.

// №3

// Даны числа, разделенные запятыми:

// '12,34,56'
// Найдите сумму этих чисел.

// №4

// Дана дата в следующем формате:

// '2025-12-31'
// Преобразуйте эту дату в следующий объект:

// {
// 	year: '2025',
// 	month: '12',
// 	day: '31',
// }



// Уровень 2.4 задачника JavaScript
// №1

// Дана некоторая строка с буквами и цифрами. Получите позицию первой цифры в этой строке.

// №2

// Дан объект с ключами и значениями. Запишите в первый массив ключи объекта, а во второй - значения.

// №3

// Дано число. Выведите в консоль количество четных цифр в этом числе.

// №4

// Дана некоторая строка:

// 'abcde'
// Переведите в верхний регистр все нечетные буквы этой строки. В нашем случае должно получится следующее:

// 'AbCdE'
// №5

// Дана некоторая строка со словами:

// 'aaa bbb ccc'
// Сделайте заглавным первый символ каждого слова в этой строке. В нашем случае должно получится следующее:

// 'Aaa Bbb Ccc'



// Уровень 2.5 задачника JavaScript
// №1

// Дана некоторая строка, например, вот такая:

// '023m0df0dfg0'
// Получите массив позиций всех нулей в этой в строке.

// №2

// Дана некоторая строка:

// 'abcdefg'
// Удалите из этой строки каждый третий символ. В нашем случае должно получится следующее:

// 'abdeg'
// №3

// Дан некоторый массив, например, вот такой:

// [1, 2, 3, 4, 5, 6]
// Поделите сумму элементов, стоящих на четных позициях, на сумму элементов, стоящих на нечетных позициях.





// Уровень 2.6 задачника JavaScript
// №1

// Дана некоторая строка с буквами и цифрами. Получите массив позиций всех цифр из этой строки.

// №2

// Дан массив с некоторыми числами, например, вот такой:

// [123, 456, 789]
// Напишите код, который перевернет числа в этом массиве по следующему принципу:

// [321, 654, 987]
// №3

// Дана некоторая строка с числом:

// '1234567'
// Отделите тройки цифр пробелами, начиная с конца числа. В нашем случае должно получится следующее:

// '1 234 567'
// №4

// Дана некоторая строка:

// 'AbCdE'
// Смените регистр букв этой строки на противоположный. В нашем случае должно получится следующее:

// 'aBcDe'
// №5

// Дан некоторый массив с числами, например, вот такой:

// [1, 2, 3, 4, 5, 6]
// Слейте пары элементов вместе:

// [12, 34, 56]
// №6

// Дана некоторая строка со словами:

// 'aaa bbb ccc eee fff'
// Сделайте заглавным первый символ каждого второго слова в этой строке. В нашем случае должно получится следующее:

// 'aaa Bbb ccc Eee fff'



// Уровень 2.7 задачника JavaScript
// №1

// Дана некоторая строка:

// 'a bc def ghij'
// Переведите в верхний регистр все подстроки, в которых количество букв меньше или равно трем. В нашем случае должно получится следующее:

// 'A BC DEF ghij'
// №2

// Дан символ. Узнайте, в каком регистре этот символ - в верхнем или нижнем.

// №3

// Дано некоторое число, например, такое:

// 123789
// Удалите из этого числа все нечетные цифры. В нашем случае получится такой результат:

// 28


// Уровень 2.8 задачника JavaScript
// №1

// Дана строка с буквами. Проверьте, что в этой строке не более двух заглавных букв.

// №2

// Дана некоторая строка:

// '1 22 333 4444 22 5555 1'
// Удалите из этой строки все подстроки, в которых количество символов больше трех. В нашем случае должно получится следующее:

// '1 22 333 22 1'
// №3

// Даны два массива:

// let arr1 = [1, 2, 3];
// let arr2 = ['a', 'b', 'c'];
// Слейте эти массивы в новый массив следующим образом:

// [1, 2, 'a', 'b', 'c', 3]



// Уровень 2.9 задачника JavaScript
// №1

// Дано некоторое число:

// 123456
// Найдите сумму пар цифр этого числа. В нашем случае имеется ввиду следующее:

// 12 + 34 + 56
// №2

// Дан массив с числами:

// [1, 2, 3, 4, 5]
// Выведите в консоль элементы этого массива в обратном порядке.


// Уровень 2.10 задачника JavaScript
// №1

// Дана строка с буквами и цифрами. Проверьте, что в этой строке не более трех букв.

// №2

// Дано число. Получите первую четную цифру с конца этого числа.

// №3

// Дана некоторая строка:

// 'abcde abcde abcde'
// Замените в ней первый символ каждого слова на '!':

// '!bcde !bcde !bcde'
// №4

// Дан массив с числами:

// [1, 2, 3, 3, 4, 5]
// Проверьте, что в этом массиве есть два одинаковых элемента подряд.



