//! Функції

//! ===========================================================

//? Напиши функцію, яка приймає два параметри (a і b) та повертає їхню суму.

const foo = (a, b) => a + b;

//! ===========================================================

//? Напиши функцію, яка приймає три параметри (a, b, c) і повертає максимальне з них.

// const foo = (a, b, c) => a > b ? (a > c ? a : c) : (b > c ? b : c);

// // *---------

// const foo = (a, b, c) => Math.max(a, b, c);

//! ===========================================================

//? Напиши функцію, яка приймає три параметри (число, мінімум і максимум) та повертає true, якщо число знаходиться між мінімумом і максимумом (включно), і false, якщо ні.

// const fooNum = (a, min, max) => a >= min && a <= max;
// console.log(fooNum(2, 3, 4));

//! ===========================================================

//? Напиши функцію, яка приймає рядок і повертає перший символ цього рядка.

// const fooStr = (str) => str[0];
// console.log(fooStr('Andrii'));

//! ===========================================================

//? Напиши функцію, яка приймає рядок і повертає останній символ цього рядка.

// const fooStr = (str) => str[str.length-1];
// console.log(fooStr('Andrii'));

//! ===========================================================

//? Напиши функцію, яка приймає число і повертає true, якщо число парне, і false, якщо ні.

// const fooNum = (num) => num % 2 === 0;

//! ===========================================================

//? Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то повернути null, в іншому випадку повернути добуток цих двох чисел.

// const fooNum = (num1, num2) => num1 !== 0 && num2 !== 0 ? num1 * num2 : null;

//! ===========================================================

//? Напиши функцію яка приймає рядок і повертає цей самий рядок але огорнутий у тег div. Приклад: на вході був рядок "Hello world" а на виході рядок "<div>Hello world<div>"

// const fooStr = (str) => `<div>${str}</div>`;

//! =========================================================

//? Напиши функцію, яка приймає рядок і повертає кількість слів у ньому (слова розділені пробілами).

// const fooStr = (str) => str.split(" ").length;

//! =========================================================

//? Напиши функцію, яка приймає рядок і повертає його довжину помножену на кількість слів в цьому рядку.

// const fooStr = (str) => str.split(" ").length * str.length;

//! =========================================================

//? Напиши функцію, яка приймає рядок і повертає кількість голосних літер у ньому (a, e, i, o, u). Використовуйте метод includes та цикл.

// const fooStr = (str) => {
//     let sum = 0;
//     const gol = ['a', 'e', 'i', 'o', 'u'];
//     for (const item of str.toLowerCase()) {
//         if (gol.includes(item)) {
//     sum += 1
// }
//     }
//     return sum;
// }

// console.log(fooStr("fooStr")); // 2 (o, o)
// console.log(fooStr("Andrii")); // 3 (A, i, i)

//! =========================================================

//? Напиши функцію, яка приймає рядок і повертає новий рядок, де слова розташовані у зворотному порядку.

// const fooStr = (str) => {
//     const rst = [];
//     const arr = str.split(' ');
//     for (const item of arr) {
//         rst.unshift(item);
//     }
//     return rst.join(' ');
// }

//! =========================================================

//? Напиши функцію, яка приймає довільну кількість аргументів і повертає true, якщо всі аргументи є числами, і false, якщо ні.

// const fooArg = (...arg) => arg.every(ar => typeof ar === "number");


//! =========================================================

//? Напиши функцію, яка приймає довільну кількість аргументів і повертає їх об'єднаними в один рядок, розділений комами.

// const fooArg = (...arg) => arg.join(',');

//! =========================================================

//? Напиши функцію, яка приймає довільну кількість чисел і повертає їхній добуток.

// const fooNum = (...num) => num.reduce((x, n) => x *= n, 1);

//! =========================================================

//? Напиши функцію, яка приймає довільну кількість чисел і повертає кількість непарних чисел серед них.

// const fooNum = (...num) => num.filter((n) => n % 2 !== 0).length;

//! =========================================================

//? Напиши функцію яка приймає довільну кількість рядочків і повертає той рядок що є найдовшим

// const fooStr = (...str) => {
//     let strO = str[0];
//     for (let i = 1; i < str.length; i++) {
//         if (str[i].length > strO.length) {
//             strO = str[i];
//        }
//     }
//     return strO;
// }

//! =========================================================

//? Напиши функцію яка приймає довільну кількість рядочків і обєднує їх в один цілий рядок.

// const fooStr = (...str) => {
//     strTotal = [];
//     for (const st of str) {
//         strTotal.push(st);
//     }
//     return strTotal.join('');
// }

//! =========================================================

//? Напиши функцію яка приймає два числа. Якщо одне з чисел дорівнює нуль то повернути null, в іншому випадку повернути добуток цих двох чисел.

// const fooNum = (num1, num2) => num1 === 0 || num2 === 0 ? null : num1 * num2;

//! =========================================================