//! ===========================================================

//? Напиши цикл, який виведе на консоль числа від 1 до 10.


// for (let i = 1; i <= 10; i++) {
//     console.log(i);
// }

//! ===========================================================

//? Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// for (let i = 2; i <= 20; i+=2) {
//     console.log(i);
// }

//! ===========================================================

//? Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//     sum += i;
// }
// console.log(sum);

//! ===========================================================

//? Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

// for (let i = 1; i <= 10; i++) {
//     console.log(`7 * ${i} = ${7*i}`);
// }

//! ===========================================================

//? Напиши цикл, який обчислить факторіал числа, введеного користувачем (наприклад, факторіал числа 5: !5 = 1 * 2 * 3 * 4 * 5).

// let num = prompt("Введіть число");
// let f = 1;
// for (let i = 1; i <= num; i++) {
//     f *= i;
// }
// console.log(f);

//! ===========================================================

//? Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"


// const str = "Hello world";
// const arr = [];
// for (let i = 0; i < str.length; i+=2) {
//     arr.push(str[i]);
// }
// console.log(arr);

//! ===========================================================

//? Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому порядку.

// const str = "Hello world";
// const arr = [];
// for (let i =  str.length -1; i >= 0; i--) {
//     arr.push(str[i]);
// }
// console.log(arr);

//! ===========================================================

//? Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне пробіл.

// const str = "Hello world";
// const arr = [];
// for (let i = 0; i < str.length; i++) {
//     if (str[i] === ' ') {
        
//         console.log(arr);
//         break;
//     }
//         arr.push(str[i]);
   
// }

//! ===========================================================

//? Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// const word = 'JavaScript'

// for (let i = 1; i < word.length; i += 2) {
//     console.log(word[i]);
// }

//! ===========================================================

//? Напиши функцію, яка приймає рядок та повертає перевернутий рядок

// const fooStr = (str) => str.split('').reverse().join('');

// console.log(fooStr('str'));

//! ===========================================================

//? Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у верхньому регістрі

// const fooStr = (str) => {
//    const arr = [];
//     const str2 = str.split('');
//     for (let i = 0; i < str2.length; i += 2) {
//         arr.push(str2[i] + (str2[i + 1] ? str2[i + 1].toUpperCase() : ''));
//     }
//     return arr.join('');
// }
//  console.log(fooStr('street'));



//! ===========================================================

//? Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до рядочка str1 стільки разів скільки вказали у параметрі count.

// const getString = (str1, str2, count) => str1 + str2.repeat(count);

//! ===========================================================