// Прості задачі

//! ===========================================================

//? Напиши функцію, яка приймає масив та виводить кожен елемент масиву у консоль.

// const fooArr = (arr) => arr.forEach((element) => console.log(element));
// const arr3 = ['Hello', '42', 'true', 'null'];
// fooArr(arr3);

//! ===========================================================

//? Напиши функцію, яка приймає масив та виводить кожен парний елемент масиву у консоль.

// const fooArr = (arr) => {
//     for (let i = 1; i < arr.length; i += 2) {
//         console.log(arr[i]);
//     }
// }

//! ===========================================================

//? Напиши функцію, яка приймає масив чисел та виводить лише парні числа у консоль.

// const fooArr = (arr) => {
//     for (const num of arr) {
//         if (num % 2 === 0) {
//             console.log(num);
//         }
//     }
// }

//! ===========================================================

//? Напиши функцію, яка приймає два параметри (arr, max). Де arr - це масив чисел. Потрібно вивести лише ті елементи масиву які більші за max.

// const foo = (arr, max) => {
//     for (const item of arr) {
//         if (item > max) {
//             console.log(item);
//         }
//     }
// }

//! ===========================================================

//? Напиши функцію яка приймає масив та повертає суму всіх чисел у масиві.

// const fooNum = (arrNum) => {
//     let sum = 0;
//     for (const num of arrNum) {
//         sum += num;
//     }
//     return sum;
// }

//! ===========================================================

//? Напиши функцію яка приймає масив та елемент для пошуку. Фукнція повинна порахувати скільки разів шуканий елемент зустрічається у масиві.

// const foo = (arr, element) => {
//     let sum = 0;
//     for (const item of arr) {
//         if (item === element) {
//             sum += 1;
//  }
//     }
//     return sum;
// }

//! ===========================================================

//? Напиши функцію яка приймає масив чисел. Функція повинна видалити усі негативні(відємні числа) з масиву та повернути новий масив.

// const fooArrNum = (arrNum) => arrNum.filter((num) => num >= 0);

//! ===========================================================

//? Напиши функцію яка приймає масив рядочків. Потрібно змінити кожен елемент масиву наступним чином - якщо довжина рядочку менша за 6 до привести рядок до нижнього регістру, в іншому випадку привести до верхнього регістру.

// const fooArr = (strs) => strs.map((str) => str.length < 6 ? str.toLowerCase() : str.toUpperCase());

//! ===========================================================

//? Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише непарні числа.

// const fooArrNum = (arrNum) => arrNum.filter((num) => num % 2 !== 0);

//! ===========================================================

//? Напиши функцію, яка приймає масив чисел і повертає новий масив, де кожне число помножене на індекс, за яким воно знаходиться в масиві.

// const fooArrNum = (arrNum) => arrNum.map((num, i) => num * i);

//! ===========================================================

//? Напиши функцію, яка приймає масив чисел і повертає новий масив, що містить лише числа, які діляться на 3.

//! ===========================================================

// Середні задачі

//! ===========================================================

//? Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише ті елементи які зустрічаються і в arr1 і arr2.

// const fooArr = (arr1, arr2) => {
//     const arr = [];
//     for (const item of arr1) {
//         for (const i of arr2) {
//             if (item === i) {
//                 arr.push(item);
//             }
//         }
//     }
//     return arr;
// }

//! ===========================================================

// Напиши функцію яка приймає два масиви (arr1, arr2), та повертає новий масив де будуть лише елементи масиву arr1 яких не має у масиві arr2.

// Напиши функцію яка приймає масив та знаходить мінімальний елемент.

// Напиши функцію яка приймає масив та знаходить максимальний елемент.

// Напиши функцію яка приймає масив та повертає масив лише з тих елементів які більші за середнє значення всіх елементів масиву.

// Напиши функцію яка приймає масив та повертає масив лише з тих елементів які більші за власний індекс.

// Напишіть функці яка приймає масив чисел. Функція повинна занйти мінімальний елемент та видалити його з масиву.

// Напиши функцію яка приймає два параметри start та end. Функія повина повернути масив де будуть числа з діапазону але лише ті у яких не має цифри 5. К прикладу числа (51, 25, 15,256) не підходять бо містять символ "5" у собі.

// Складні
// Напиши функцію, яка приймає массив чисел і повертає новий масив, де всі парні числа переміщені в початок, а всі непарні - в кінець.

// Напиши функцію, яка приймає массив чисел і повертає новий массив, де кожен елемент є сумою усіх попередніх елементів.

// Напиши функцію, яка приймає массив чисел і повертає новий массив, що містить лише унікальні числа.

// Напиши функцію, яка приймає два масиви і повертає об'єднаний массив без дублювання елементів.

// Напиши функцію, яка приймає массив чисел і повертає новий массив, де кожен елемент є середньоарифметичним всіх сусідніх елементів.

// Напиши функцію, яка приймає массив чисел і повертає новий массив, де елементи відсортовані в порядку збільшення або зменшення.

// Напиши функцію, яка приймає массив рядочків та сортує їх за довжиною елементів.