// Напиши цикл, який виведе на консоль числа від 1 до 10.

// Напиши цикл, який виведе на консоль парні числа від 1 до 20.

// Напиши цикл, який знайде та виведе на консоль суму всіх чисел від 1 до 100.

// Напиши цикл, який виведе на консоль таблицю множення для числа 7 (від 1 до 10).

// Напиши цикл, який обчислить факторіал числа, введеного користувачем (наприклад, факторіал числа 5: !5 = 1 * 2 * 3 * 4 * 5).

// Напиши цикл, який виведе кожну другу літеру рядочку "Hello world"

// Напиши цикл, який виведе кожну літеру рядочку "Hello world" у зворотньому порядку.

// Напиши цикл, який виведе кожну літеру рядочку "Hello world" поки не зустріне пробіл.

// Напиши цикл, який виведе на консоль кожну другу літеру слова "JavaScript".

// Напиши функцію, яка приймає рядок та повертає перевернутий рядок

// Напиши функцію, яка приймає рядок та повертає рядок де кожен другий символ у верхньому регістрі

// Напиши функцію getString(str1, str2, count). Функція повинна додати str2 до рядочка str1 стільки разів скільки вказали у параметрі count.