// !  ================================================================================================================

//? Задача-1
//? Напишіть функцію яка приймає два параметри str1 та str2.
//? Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2.
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1[0] === str2[str2.length - 1] };

// !  ================================================================================================================

//? Задача-2
//? Напишіть функцію яка приймає два параметри str1 та str2.
//?  Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює першій літері str2.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1[0] === str2[0] };

// !  ================================================================================================================

//? Задача-3
//? Напишіть функцію яка приймає два параметри str1 та str2.
//?  Функція повинна повернути булеве значення true якщо довжина str1 дорівнює довжині str2.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1.length === str2.length };
 
// !  ================================================================================================================

Задача-4
Напишіть функцію яка приймає число num.
 Функція повинна повернути булеве значення true якщо кількість цифр у числі парна.
 В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------
 
// const foo = (num) => { return String(num).length % 2 === 0 };

// !  ================================================================================================================

Задача-5
Напишіть функцію, яка приймає два параметри num1 та num2.
 Функція повинна повернути булеве значення true, якщо num1 більше, ніж num2.
 В іншому випадку функція повинна повернути булеве значення false.

 //* --------------------------------------------------------

// const foo = (num1, num2) => num1 > num2;

// !  ================================================================================================================

//? Задача-6
//? Напишіть функцію, яка приймає два параметри num1 та num2.
//?  Функція повинна повернути булеве значення true, якщо num1 ділиться на num2 без остачі.
//?  В іншому випадку функція повинна повернути булеве значення false.

  //* --------------------------------------------------------

// const foo = (num1, num2) => num1 % num2 === 0;
 
// !  ================================================================================================================

//? Задача-7
//? Напишіть функцію, яка приймає число num.
//?  Функція повинна повернути булеве значення true, якщо num є непарним числом.
//?  В іншому випадку функція повинна повернути булеве значення false.

  //* --------------------------------------------------------

// const foo = (num) => num % 2 !== 0;

// !  ================================================================================================================

//? Задача-8
//? Напишіть функцію, яка приймає параметр str.
//?  Функція повинна повернути булеве значення true, якщо str містить принаймні одну велику літеру.
//?  В іншому випадку функція повинна повернути булеве значення false.

//? Підказка: допоможе toLowerCase();

//* --------------------------------------------------------
  
// const foo = (str1) => str1 !== str1.toLowerCase();

// !  ================================================================================================================

//? Задача-9
//? Напишіть функцію, яка приймає два параметри str1 та str2.
//?  Функція повинна повернути булеве значення true, якщо довжина str1 більше, ніж довжина str2.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => str1.length > str2.length;

// !  ================================================================================================================

//? Задача-12
//? Напишіть функцію, яка приймає рядок str.
//?  Функція повинна повернути булеве значення true, якщо str містить хоча б один пробіл.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1) => {
//   for (let item of str1) {
//     if (item === ' ') {
//       return true;
//     }
//   }
//   return false;
// }

//!  ================================================================================================================

//? Задача-14
//? Напишіть функцію, яка приймає рядок str.
//? Функція повинна повернути булеве значення true, якщо str є паліндромом(однаковий у зворотному напрямку).
//? В іншому випадку функція повинна повернути булеве значення false.

//? Підказка: тут допоможе метод масиву reverse();

//* --------------------------------------------------------

// const foo = (str) => {
//   const reversed = str.split('').reverse().join('');
//  return reversed === str;
  
//   }

//!  ================================================================================================================

//? Задача-15
//? Напишіть функцію, яка приймає два параметри num1 та num2.
//? Функція повинна повернути булеве значення true, якщо num1 менше або дорівнює num2.
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (num1, num2) => num1 <= num2;

//!  ================================================================================================================

//? Задача-17
//? Напишіть функцію, яка приймає рядок str.
//? Функція повинна повернути булеве значення true, якщо перша літера str є голосною(a, e, i, o, u).
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str) => {
//   const strGol = ['a', 'e', 'i' ,'o' ,'u'];
//    return strGol.includes(str[0].toLowerCase());
// }

//!  ================================================================================================================

//? Задача-19
//? Напишіть функцію, яка приймає два параметри num1 та num2.
//? Функція повинна повернути булеве значення true, якщо num1 і num2 рівні.
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (num1, num2) => num1 === num2;

//!  ================================================================================================================

//? Задача-20
//? Напишіть функцію, яка приймає число num.
//? Функція повинна повернути булеве значення true, якщо num більше або дорівнює нулю.
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (num) => num >= 0;

//!  ================================================================================================================

//? Задача-21
//? Напишіть функцію, яка приймає рядок str.
//? Функція повинна повернути булеве значення true, якщо довжина str є парною.
//? В іншому випадку функція повинна повернути булеве значення false.

// const foo = (str) => str.length % 2 === 0;

//!  ================================================================================================================

//? Задача-22
//? Напишіть функцію, яка приймає два параметри num1 та num2.
//? Функція повинна повернути булеве значення true, якщо num1 ділиться на 2, а num2 не ділиться на 2.
//? В іншому випадку функція повинна повернути булеве значення false.

// const foo = (num1, num2) => num1 % 2 === 0 && num2 % 2 !== 0;

//!  ================================================================================================================

//? Задача-23
//? Напишіть функцію, яка приймає число num.
//? Функція повинна повернути булеве значення true, якщо num більше 100, але менше 200.
//? В іншому випадку функція повинна повернути булеве значення false.

// const foo = (num) => num > 100 && num < 200;

//!  ================================================================================================================

//? Задача-24
//? Напишіть функцію, яка приймає рядок str.
//? Функція повинна повернути булеве значення true, якщо str містить лише маленькі літери.
//? В іншому випадку функція повинна повернути булеве значення false.

//? Підказка: допоможе toLowerCase();

// const foo = (str) => str === str.toLowerCase();

//!  ================================================================================================================

