//* ==========================================================================================================================

//? Створіть змінну з ім'ям name і присвойте їй ваше ім'я.Виведіть це ім'я в консоль.

//? Створіть змінну age і присвойте їй ваш вік. Виведіть в консоль рядок, що містить ваш вік у такому форматі: "Мені {вік} років".

//? Створіть змінні x і y і присвойте їм довільні числа. Виведіть в консоль результати додавання, віднімання, множення та ділення цих чисел.

//? Створіть змінну city і присвойте їй назву вашого міста. Створіть рядок, який містить "Я живу в місті {назва міста}", і виведіть його в консоль.

//? Створіть змінну price і присвойте їй число. Створіть рядок, що містить ціну з символом гривні, наприклад: "Ціна: 500 грн".

// const name = 'Andrii';
// console.log(name);
// const age = '50';
// console.log(`Мені ${age} років`);
// const x = Math.floor(Math.random() * (1000 - 1 + 1)) + 1;
// const y = Math.floor(Math.random() * (1000 - 1 + 1)) + 1;
// console.log(x + y, x - y, x * y, x / y);
// const city = 'Біла Церква'
// console.log(`Я живу в місті ${city}`);
// const price = String(Math.floor(Math.random() * (1000 - 1 + 1)) + 1);
// console.log(`Ціна: ${price} грн.`)

//* ==========================================================================================================================

//?

const atTheOldToad = {
  potions: [
    { name: "Speed potion", price: 460 },
    { name: "Stone skin", price: 520 },
  ],
  getPotions() {
    return this.potions;
  },
  addPotion(newPotion) {
    this.potions.push(newPotion);
  },
    getTotalPrice() {
        let total = 0;
    for (let i = 0; i < potions.price; i++)
      total += i;
  
  },
    
};
console.log(total);