// !  ================================================================================================================

//? Задача-1
//? Напишіть функцію яка приймає два параметри str1 та str2.
//? Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2.
//? В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1[0] === str2[str2.length - 1] };

// !  ================================================================================================================

//? Задача-2
//? Напишіть функцію яка приймає два параметри str1 та str2.
//?  Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює першій літері str2.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1[0] === str2[0] };

// !  ================================================================================================================

//? Задача-3
//? Напишіть функцію яка приймає два параметри str1 та str2.
//?  Функція повинна повернути булеве значення true якщо довжина str1 дорівнює довжині str2.
//?  В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------

// const foo = (str1, str2) => { return str1.length === str2.length };
 
// !  ================================================================================================================

Задача-4
Напишіть функцію яка приймає число num.
 Функція повинна повернути булеве значення true якщо кількість цифр у числі парна.
 В іншому випадку функція повинна повернути булеве значення false.

//* --------------------------------------------------------
 
// const foo = (num) => { return String(num).length % 2 === 0 };

// !  ================================================================================================================

Задача-5
Напишіть функцію, яка приймає два параметри num1 та num2.
 Функція повинна повернути булеве значення true, якщо num1 більше, ніж num2.
 В іншому випадку функція повинна повернути булеве значення false.

 //* --------------------------------------------------------

// const foo = (num1, num2) => num1 > num2;

// !  ================================================================================================================

//? Задача-6
//? Напишіть функцію, яка приймає два параметри num1 та num2.
//?  Функція повинна повернути булеве значення true, якщо num1 ділиться на num2 без остачі.
//?  В іншому випадку функція повинна повернути булеве значення false.

  //* --------------------------------------------------------

// const foo = (num1, num2) => num1 % num2 === 0;
 
// !  ================================================================================================================

//? Задача-7
//? Напишіть функцію, яка приймає число num.
//?  Функція повинна повернути булеве значення true, якщо num є непарним числом.
//?  В іншому випадку функція повинна повернути булеве значення false.

  //* --------------------------------------------------------

// const foo = (num) => num % 2 !== 0;

// !  ================================================================================================================