//* ==================================================================================================

//! Задача №1.1 / 1
//? Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.

// const randomNumber = Math.round(Math.random() * 2001) - 1000;
// if (randomNumber < 0) {
//   console.log(`${randomNumber} - число отрицательное`);
// } else if (randomNumber > 0) {
//   console.log(`${randomNumber} - число положительное`);
// } else {
//   console.log(`${randomNumber} - не имеет знака`);
// }

//* ==================================================================================================

//! Задача №№1.1 / 2
//? Дана строка. Выведите в консоль длину этой строки.

// const text = 'Выведите в консоль длину этой строки';
// console.log(text.length);

//* ==================================================================================================

//! Задача №1.1 / 3
//? Дана строка. Выведите в консоль последний символ строки.

// const text = 'Выведите в консоль последний символ строки';
// console.log(text[text.length - 1]);

//* ==================================================================================================

//! Задача №1.1 / 4
//? Дано число. Проверьте, четное оно или нет.

// const randomNumber = Math.round(Math.random() * 1001);
// if (randomNumber % 2 === 0) {
//   console.log(`Число ${randomNumber} - четное`);
// } else {
//   console.log(`Число ${randomNumber} - нечетное`);
// }

//* ==================================================================================================

//! Задача №1.1 / 5
//? Даны два слова. Проверьте, что первые буквы этих слов совпадают.

// const word1 = prompt('Введіть перше слово:');
// const word2 = prompt('Введіть друге слово:');
// if (word1[0] === word2[0]) {
//   alert('Первые буквы совпадают');
// } else {
//   alert('Первые буквы не совпадают');
// }

//* ==================================================================================================

//! Задача №1.2 / 1
//? Дано число. Выведите в консоль первую цифру этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// console.log(String(randomNumber)[0]);

//* ==================================================================================================

//! Задача №1.2 / 2
//? Дано число. Выведите в консоль последнюю цифру этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// const numberString = String(randomNumber);
// console.log(randomNumber);
// console.log(numberString.slice(-1));

//* ==================================================================================================

//! Задача №1.2 / 3
//? Дано число. Выведите в консоль сумму первой и последней цифры этого числа.

// const randomNumber = Math.round(Math.random() * 1001);
// const number1 = Number(String(randomNumber)[0]);
// const number2 = Number(String(randomNumber).slice(-1));
// console.log(randomNumber);
// console.log(number1 + number2);

//* ==================================================================================================

//! Задача №1.2 / 4
//? Дано число. Выведите количество цифр в этом числе.

// const randomNumber = Math.round(Math.random() * 1001);
// console.log(randomNumber);
// console.log(String(randomNumber).length);

//* ==================================================================================================

//! Задача №1.2 / 5
//? Даны два числа. Проверьте, что первые цифры этих чисел совпадают.

// const randomNumber1 = Math.round(Math.random() * 1001);
// const randomNumber2 = Math.round(Math.random() * 1001);
// console.log(randomNumber1, randomNumber2);
// if (String(randomNumber1)[0] === String(randomNumber2)[0]) {
//   console.log(
//     `первые цифры чисел ${randomNumber1} и ${randomNumber2} совпадают`
//   );
// } else {
//   console.log(
//     `первые цифры чисел ${randomNumber1} и ${randomNumber2} НЕ совпадают`
//   );
// }

//* ==================================================================================================

//! Задача №1.3 / 1
//? Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

// const string = prompt('Введите слово или предложение:');
// const str = String(string).slice(-2, -1);
// if (str) {
//   alert(`предпоследний символ этой строки это "${str}`);
// } else {
//   alert('Данна страка имеет один символ');
// }

//* ==================================================================================================

//! Задача №1.3 / 2
//? Даны два целых числа. Проверьте, что первое число без остатка делится на второе.

// const randomNumber1 = Math.round(Math.random() * 901) + 100;
// const randomNumber2 = Math.round(Math.random() * 100) + 1;
// const quotient = randomNumber1 % randomNumber2;
// console.log(randomNumber1, randomNumber2);
// if (quotient === 0) {
//   console.log('Первое число без остатка делится на второе');
// } else {
//   console.log(`Первое число делится на второе с остатком ${quotient}`);
// }

//* ==================================================================================================

//! Задача №1.4 / 1
//? Выведите в консоль все целые числа от 1 до 100.

// for (let i = 1; i <= 100; i++) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 2
//? Выведите в консоль все целые числа от -100 до 0.

// for (let i = -100; i <= 0; i++) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 3
//? Выведите в консоль все целые числа от 100 до 1.

// for (let i = 100; i >= 1; i--) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 4
//? Выведите в консоль все четные числа из промежутка от 1 до 100.

// for (let i = 2; i <= 100; i += 2) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.4 / 5
//? Выведите в консоль все числа кратные трем в промежутке от 1 до 100.

// for (let i = 3; i <= 100; i += 3) {
//   console.log(i);
// }

//* ==================================================================================================

//! Задача №1.5 / 1
//? Найдите сумму всех целых чисел от 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i++) {
//   sum += i;
// }
// console.log(sum);

//* ==================================================================================================

//! Задача №1.5 / 2
//? Найдите сумму всех целых четных чисел в промежутке от 1 до 100.

// let sum = 0;
// for (let i = 2; i <= 100; i += 2) {
//   sum += i;
// }
// console.log(sum);

//* ==================================================================================================

// ! Задача №1.5 / 3
//? Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.

// let sum = 0;
// for (let i = 1; i <= 100; i += 2) {
//   sum += i;
// }
// console.log(sum);

//* =================================================================================================

//! Задача №1.5 / 4
//? Даны два целых числа. Найдите остаток от деления первого числа на второе.

// const randomNumber1 = Math.round(Math.random() * 901) + 100;
// const randomNumber2 = Math.round(Math.random() * 100) + 1;
// const quotient = randomNumber1 % randomNumber2;
// console.log(randomNumber1, randomNumber2);
// console.log(quotient);

//* =================================================================================================

//! Задача №1.5 / 5
//? Дана некоторая строка. Переберите и выведите в консоль по очереди все символы с конца строки.

// const string = prompt('Введите слово или предложение:');
// for (let i = string.length - 1; i >= 0; i--) {
//   console.log(string[i]);
// }

//* =================================================================================================

//! Задача №1.6 / 1
//? Дан массив с числами. Найдите сумму квадратов элементов этого массива.

// function abc(params) {
//   let sum = 0;
//   for (let i = 0; i < params.length; i++) {
//     sum += params[i] * params[i];
//   }
//   return sum;
// }
// const params = [2, 5, 8, 6, 5, 4];
// console.log(abc(params));

//* =================================================================================================

//! Задача №1.6 / 2
//? Дан массив с числами. Найдите сумму квадратных корней элементов этого массива.

// function abc(params) {
//   let sum = 0;

//   for (let i = 0; i < params.length; i++) {
//     sum += Math.sqrt(params[i]);
//   }

//   return sum;
// }

// const params = [4, 9, 16, 25, 36, 121];
// console.log(abc(params));

//* =================================================================================================

//! Задача №1.6 / 3
//? Дан массив с числами. Найдите сумму положительных элементов этого массива.

// function foo(elen) {
//   let newElen = [];
//   for (let i = 0; i < elen.length; i++) {
//     if (elen[i] >= 0) {
//       newElen.push(elen[i]);
//     }
//   }
//   return newElen;
// }
// const elen = [4, 9, 16, -20, 25, 36, 121];
// console.log(foo(elen));

//* =================================================================================================

//! Задача №1.6 / 4
//? Дан массив с числами. Найдите сумму тех элементов этого массива, которые больше нуля и меньше десяти.

// function num(arr) {
//   let sum = 0;
//   for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 0 && arr[i] < 10) {
//       sum += arr[i];
//     }
//   }
//   return sum;
// }
// console.log(num([4, 9, 16, -20, 25, 36, 121]));

//* =================================================================================================

//! Задача №1.7 / 1
//? Дана строка:
//? 'abcde'
//? Получите массив букв этой строки.

// const str = 'abcde';
// const mas = str.split('');
// console.log(mas);

//* =================================================================================================

//! Задача №1.7 / 2
//? Дано некоторое число:
//? 12345
//? Получите массив цифр этого числа.

// const num = 12345;
// const str = String(num);
// const mas = str.split('');
// const rez = [];
// for (let i of mas) {
//   rez.push(Number(i));
// }
// console.log(rez);

//* =================================================================================================

//! Задача №1.7 / 3
//? Дано некоторое число:
//? 12345
//? Переверните его:
//? 54321

// const num = 12345;
// const str = String(num);
// const mas = str.split('');
// const rez = [];
// for (let i of mas) {
//   rez.push(Number(i));
// }
// const revRez = rez.reverse();
// const newNum = Number(revRez.join(''));
// console.log(newNum);

//* =================================================================================================

//! Задача №1.7 / 4
//? Дано некоторое число:
//? 12345
//? Найдите сумму цифр этого числа.

// const num = 12345;
// const str = String(num);
// const mas = str.split('');
// let sum = 0;
// for (let i of mas) {
//   sum += Number(i);
// }
// console.log(sum);

//* =================================================================================================

//! Задача №1.8 / 1
//? Заполните массив целыми числами от 1 до 10.

// const num = [];
// for (let i = 1; i < 11; i++) {
//   num.push(i);
// }
// console.log(num);

//* =================================================================================================

//! Задача №1.8 / 2
//? Заполните массив четными числами из промежутка от 1 до 100.

// const even = [];
// for (let i = 1; i < 101; i++) {
//   if (i % 2 === 0) {
//     even.push(i);
//   }
// }

// console.log(even);

//* =================================================================================================

//! Задача №1.8 / 3
//? Дан массив с дробями:
//? [1.456, 2.125, 3.32, 4.1, 5.34]
//? Округлите эти дроби до одного знака в дробной части.

// const dan = [1.456, 2.125, 3.32, 4.1, 5.34];
// const okr = [];

// for (let elem of dan) {
//   okr.push(Number(elem.toFixed(1)));
// }

// console.log(okr);

//* =================================================================================================

//! Задача №1.9 / 1
//? Дан массив со строками. Оставьте в этом массиве только те строки, которые начинаются на http://.

// const arr = [
//   'ghjgg',
//   'http://code.mu/',
//   'djh',
//   'dfhjk',
//   'http://www.edu.goit.global/',
//   'hdjjk',
// ];
// const rez = [];
// for (let i = 0; i < arr.length; i++) {
//   if (arr[i].startsWith('http://')) {
//     rez.push(arr[i]);
//   }
// }
// console.log(rez);

//* =================================================================================================

//! Задача №1.9 / 2
//? Дан массив со строками. Оставьте в этом массиве только те строки, которые заканчиваются на .html.

// const arr = [
//   'ghjgg',
//   'http://code.mu/',
//   'djh.html',
//   'dfhjk',
//   'http://www.edu.goit.global/',
//   'hdjjk.html',
// ];
// const rez = [];
// for (let i = 0; i < arr.length; i++) {
//   if (arr[i].endsWith('.html')) {
//     rez.push(arr[i]);
//   }
// }
// console.log(rez);

//* =================================================================================================

//! Задача №1.9 / 3
//? Дан массив с числами. Увеличьте каждое число из массива на 10 процентов.

// const num = [4, 9, 16, -20, 25, 36, 121];

// const rez = [];
// for (let i of num) {
//   rez.push(i + i / 10);
// }
// console.log(rez);

//* =================================================================================================

//! Задача №1.10 / 1
//? Заполните массив случайными числами из промежутка от 1 до 100.

// const mus = [];
// for (let i = 1; i < 11; i++) {
//   const randomNumber = Math.floor(Math.random() * (100 - 1 + 1)) + 1;
//   mus.push(randomNumber);
// }
// console.log(mus);

//* =================================================================================================

//! Задача №1.10 / 2
//? Дано некоторое число:
//? 12345
//? Выведите в консоль все его символы с конца.

// const num = 12345;
// const str = num.toString();
// const arr = str.split('');
// const klo = arr.reverse();
// const njoin = klo.join();
// console.log(njoin);

//* =================================================================================================

//! Задача №1.10 / 3
//?Дан некоторый массив, например, вот такой:
//? [1, 2, 3, 4, 5, 6]
//? По очереди выведите в консоль подмассивы из двух элементов нашего массива:
//? [1, 2]
//? [3, 4]
//? [5, 6]

// const mus = [1, 2, 3, 4, 5, 6];
// for (let i = 0; i < mus.length; i += 2) {
//   console.log(mus[i], mus[i + 1]);
// }

//* =================================================================================================

//! Задача №1.10 / 4
//?  Даны два массива:
//? let arr1 = [1, 2, 3];
//? let arr2 = [4, 5, 6];
//? Слейте эти массивы в новый массив:
//? [1, 2, 3, 4, 5, 6]

// let arr1 = [1, 2, 3];
// let arr2 = [4, 5, 6];

// const arr3 = arr1.concat(arr2);
// console.log(arr3);
