//! Уровень 7.1 задачника JavaScript

//* =======================================================================

//? №1
//? Дана кнопка и список ul, заполненный числами. По клику на кнопку удалите пункт списка, содержащий самое максимальное число.

// const main = document.querySelector('main');
// const btn = document.createElement('button');
// btn.textContent = 'Видалити';
// const ul = document.createElement('ul');
// ul.innerHTML = `
//   <li>25</li>
//   <li>26</li>
//   <li>65</li>
//   <li>66</li>
//   <li>85</li>
//   <li>28</li>`;
// main.append(btn, ul);

// btn.addEventListener('click', () => {
//   const listAll = [...document.querySelectorAll('li')];
//   if (listAll.length > 0) {
//     const sortList = listAll.toSorted((a, b) => Number(b.textContent) - Number(a.textContent));
//     sortList[0].remove();
//   }
//   return;
// });

//* =======================================================================

//? №2
//? Дан абзац, содержащий текст со словами. Дана также кнопка. По клику на кнопку возьмите каждое слово в свой тег span.

// const div = document.querySelector('.div');
// const text = document.createElement('p');
// text.textContent = 'текст со словами';
// const btn = document.createElement('button');
// btn.textContent = 'span';
// div.append(text, btn);

// btn.addEventListener('click', () => {
//   const arr = text.textContent
//     .split(' ')
//     .map(item => `<span>${item}</span>`)
//     .join(' ');
//   text.innerHTML = arr;
// });

//* =======================================================================

//? №3
//? Дан абзац, содержащий текст со словами и с дробями вида 1/2. Дана также кнопка. По клику на кнопку возьмите каждую дробь в свой тег span.

// const div = document.querySelector('.div');
// const text = document.createElement('p');
// text.textContent = 'текст со словами и с дробями вида 1/2 или 2/5';
// const btn = document.createElement('button');
// btn.textContent = 'Обгорнути дроби';
// div.append(text, btn);

// btn.addEventListener('click', () => {
//   const words = text.textContent.split(' ');

//   const result = words.map(word => {
//     if (/^\d+\/\d+$/.test(word)) {
//       const span = document.createElement('span');
//       span.textContent = word;
//       return span.outerHTML;
//     }

//     return word;
//   });

//   text.innerHTML = result.join(' ');
// });

//* =======================================================================

//? №4
//? Дана таблица и инпут. В инпут вводится дата рождения юзера в формате год-месяц-день. Выведите в первой колонке все даты рождения юзера, а во второй колонке - соответствующие дни недели.

// const div = document.querySelector('.div');

// const input = document.createElement('input');
// input.type = 'date';

// const table = document.createElement('table');

// div.append(input, table);

// input.addEventListener('input', () => {
//   table.innerHTML = '';

//   if (!input.value) {
//     return;
//   }

//   const birthday = new Date(input.value);
//   const birthYear = birthday.getFullYear();
//   const birthMonth = birthday.getMonth();
//   const birthDay = birthday.getDate();
//   const currentYear = new Date().getFullYear();

//   if (birthday > new Date()) {
//     return;
//   }

//   for (let year = birthYear; year <= currentYear; year++) {
//     const date = new Date(year, birthMonth, birthDay);

//     const tr = document.createElement('tr');

//     const dateTd = document.createElement('td');
//     dateTd.textContent = date.toLocaleDateString('uk-UA');

//     const dayTd = document.createElement('td');
//     dayTd.textContent = date.toLocaleDateString('uk-UA', {
//       weekday: 'long',
//     });

//     tr.append(dateTd, dayTd);
//     table.append(tr);
//   }
// });

//* =======================================================================

//? №5
//? Напишите программу, которая сформирует следующий массив:
//? [
//? 	[
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 	],
//? 	[
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 	],
//? 	[
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 		[1, 2, 3],
//? 	],
//? ]

// const arr1 = [1, 2, 3];
// const arr2 = [];
// const arr3 = [];

// for (let i = 0; i < 3; i++) {
//   arr2.push([...arr1]);
// }

// for (let i = 0; i < 3; i++) {
//   arr3.push([...arr2]);
// }

// console.log(arr3);

//* =======================================================================

//! Уровень 7.2 задачника JavaScript

//* =======================================================================

//? №1
//? Дан список ul с числами, инпут и кнопка. В инпут вводится число. По клику на кнопку покрасьте в красный цвет li, содержащее введенное число.

// const div = document.querySelector('.div');
// const ul = document.createElement('ul');
// ul.innerHTML = `<li>2</li><li>5</li><li>8</li><li>6</li><li>12</li><li>42</li><li>72</li><li>26</li><li>28</li><li>88</li>`;
// const input = document.createElement('input');
// input.type = 'number';
// const btn = document.createElement('button');
// btn.textContent = 'color red';
// div.append(ul, input, btn);

// btn.addEventListener('click', () => {
//   if (input.value === '') return;
//   const num = Number(input.value);
//   const arr = [...document.querySelectorAll('li')];
//   const index = arr.findIndex(li => Number(li.textContent) === num);
//     if (index === -1) return;
//   arr[index].style.backgroundColor = 'red';
// });

//* =======================================================================

//? №2
//? Дан инпут. В него вводится год. Выведите даты всех пятниц 13-е заданного года в виде списка ul.

// const div = document.querySelector('.div');
// const input = document.createElement('input');
// input.type = 'number';
// const ul = document.createElement('ul');
// div.append(input, ul);

// input.addEventListener('input', () => {
//   ul.innerHTML = '';

//   const year = Number(input.value);

//   if (!input.value || year < 1 || !Number.isInteger(year)) return;

//   for (let month = 0; month < 12; month++) {
//     const date = new Date(year, month, 13);

//     if (date.getDay() === 5) {
//       const li = document.createElement('li');
//       li.textContent = date.toLocaleDateString('uk-UA');
//       ul.append(li);
//     }
//   }
// });

//* =======================================================================

//? №3
//? Даны чекбоксы, с помощью которых у юзера спрашиваются языки, которые он знает. Дан также абзац. По мере выбора чекбоксов юзером выводите в абзац выбранные языки через запятую.

// const div = document.querySelector('.div');
// const ul = document.createElement('ul');
// ul.innerHTML = `
// <li><input type="checkbox" />JavaScript</li>
// <li><input type="checkbox" />TypeScript</li>
// <li><input type="checkbox" />Python</li>
// <li><input type="checkbox" />Java</li>
// <li><input type="checkbox" />C#</li>
// <li><input type="checkbox" />C++</li>
// <li><input type="checkbox" />PHP</li>
// <li><input type="checkbox" />Go</li>
// <li><input type="checkbox" />Kotlin</li>
// <li><input type="checkbox" />Swift</li>
// <li><input type="checkbox" />SQL</li>
// <li><input type="checkbox" />Rust</li>
// `;
// const text = document.createElement('p');
// div.append(ul, text);

// ul.addEventListener('change', e => {
//   if (e.target.tagName !== 'INPUT') return;
//   const arr = [...document.querySelectorAll('li input')];
//   const arrText = arr
//     .filter(item => item.checked === true)
//     .map(item => item.parentElement.textContent);

//   text.textContent = arrText.join(', ');
// });

//* =======================================================================

//? №4
//? Напишите программу, которая сформирует следующий массив:
//? [
//? 	['x'],
//? 	['x', 'x'],
//? 	['x', 'x', 'x'],
//? 	['x', 'x', 'x', 'x'],
//? 	['x', 'x', 'x', 'x', 'x'],
//? ]

// function xxx() {
//   const arr = [];
//   let count = 0;

//   for (let i = 0; i < 5; i++) {
//     const arrX = [];
//     count++;
//     for (let j = 0; j < count; j++) {
//       arrX.push('x');
//     }
//     arr.push(arrX);
//   }

//   return arr;
// }
// console.log(xxx());

//* =======================================================================

//? №5
//? Дан следующая верстка:
//? <p>111</p>
//? <p>222</p>
//? <p>333</p>
//? <p>444</p>
//? <p>555</p>
//? Получите содержимое текстов абзацев в виде массива:
//? [
//? 	'111',
//? 	'222',
//? 	'333',
//? 	'444',
//? 	'555',
//? ]

// const div = document.querySelector('.div');
// div.innerHTML = `<p>111</p><p>222</p><p>333</p><p>444</p><p>555</p>`;
// const arr = [...div.querySelectorAll('p')].map(item => item.textContent);
// console.log(arr);

//! =======================================================================

//; Уровень 7.3 задачника JavaScript

//! =======================================================================

//? №1
//? Дан абзац, содержащий текст со словами. Некоторые слова повторяются два раза. По клику на кнопку удалите лишние одинаковые рядом стоящие слова.

// const div = document.querySelector('.div');
// const text = document.createElement('p');
// text.textContent = 'текст зі словами словами';
// const btn = document.createElement('button');
// btn.textContent = 'Видалити повтори';
// div.append(text, btn);

// btn.addEventListener('click', () => {
//   const arrText = text.textContent.split(' ');

//   for (let i = 0; i < arrText.length - 1; i++) {
//     if (arrText[i] === arrText[i + 1]) {
//       arrText.splice(i + 1, 1);
//       i--;
//     }
//   }

//   text.textContent = arrText.join(' ');
// });

//* =======================================================================

//? №2
//? Сделайте функцию, которая будет возвращать массив, заполненный N случайными числами из заданного диапазона так, чтобы числа не повторялись.

// function numArr(min, max, N) {
//   const arr = [];
//   while (arr.length < N) {
//     const randomNumber = Math.floor(Math.random() * (max - min + 1)) + min;
//     if (!arr.includes(randomNumber)) {
//       arr.push(randomNumber);
//     }
//   }
//   return arr;
// }

// console.log(numArr(1, 10, 5));

//* =======================================================================

//? №3
//? Дан следующая структура данных:
//? let data = [
//? 	{
//? 		text: '111',
//? 		href: '1.html',
//? 	},
//? 	{
//? 		text: '222',
//? 		href: '2.html',
//? 	},
//? 	{
//? 		text: '333',
//? 		href: '3.html',
//? 	},
//? ]
//? Сформируйте с помощью этих данных следующую верстку:
//? <a href="1.html">111</a>
//? <a href="2.html">222</a>
//? <a href="3.html">222</a>

// const div = document.querySelector('.div');
// let data = [
//   {
//     text: '111',
//     href: '1.html',
//   },
//   {
//     text: '222',
//     href: '2.html',
//   },
//   {
//     text: '333',
//     href: '3.html',
//   },
// ];

// div.innerHTML = data
//   .map(item => `<a href="${item.href}">${item.text}</a>`)
//   .join('');

//! =======================================================================

//; Уровень 7.4 задачника JavaScript

//! =======================================================================

//? №1
//? Дан ul. Выведите в него дни текущего месяца. Текущий день, а также выходные, выделите другими цветами.

// const div = document.querySelector('.div');
// const ul = document.createElement('ul');
// const today = new Date();
// const year = today.getFullYear();
// const month = today.getMonth();
// const dates = new Date(year, month + 1, 0).getDate();

// for (let i = 1; i <= dates; i++) {
//   const dayI = new Date(year, month, i);
//   const li = document.createElement('li');
//   li.textContent = i;
//   if (i === today.getDate()) {
//     li.style.backgroundColor = 'green';
//   } else if (dayI.getDay() === 0 || dayI.getDay() === 6) {
//     li.style.backgroundColor = 'red';
//   }
//   ul.append(li);
// }
// div.append(ul);

//* =======================================================================

//? №2
//? Дан абзац, содержащий текст со словами. Сделайте так, чтобы по клику на любое слово из этого абзаца, это слово выделялось красным цветом.

// const div = document.querySelector('.div');
// const text = document.createElement('p');
// text.textContent = 'текст зі словами';
// div.append(text);
// const arr = text.textContent.split(' ').map(item => `<span>${item}</span>`);
// text.innerHTML = arr.join(' ');
// text.addEventListener('click', e => {
//   if (e.target.tagName !== 'SPAN') {
//     return;
//   }
//   e.target.style.color = 'red';
// });

//* =======================================================================

//? №3
//? Дан инпут и кнопка. В него вводится число из четного количества цифр. По клику на кнопку проверьте, что число представляет собой счастливый билет, то есть сумма половины цифр равна сумме второй половине цифр.

//* =======================================================================

// №4

// Дан инпут. В него вводится текст. Сделайте так, чтобы в инпут нельзя было ввести больше десяти символов. При превышении количества, символы просто не должны вводиться.

//* =======================================================================

// №5

// Дан инпут, абзац и кнопка. В инпут вводится число. По нажатию на кнопку сделайте так, чтобы в абзаце начал тикать обратный отсчет от введенного в инпут числа до нуля.

//* =======================================================================

// №6

// Напишите программу, которая сформирует следующий массив:

// [
// 	[1],
// 	[1, 2],
// 	[1, 2, 3],
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3, 4, 5, 6],
// ]

//* =======================================================================

// Уровень 7.5 задачника JavaScript

//* =======================================================================

// №1

// Дана кнопка. По клику на кнопку плавно прокрутите окно браузера до самого низа.

//* =======================================================================

// №2

// Даны кнопки и дивы. Каждая кнопка соответствует своему диву. Сделайте так, чтобы по первому клику на кнопку открывался ее див, а по второму клику - скрывался.

//* =======================================================================

// №3

// Сделайте функцию, которая будет принимать строку на русском языке, а возвращать ее транслит.

//* =======================================================================

// №4

// Напишите программу, которая сформирует следующий массив:

// [
// 	['x', 'x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x'],
// 	['x', 'x'],
// 	['x'],
// ]

//* =======================================================================

// Уровень 7.6 задачника JavaScript

//* =======================================================================

// №1

// На странице через абсолютное позиционирование расположены два дива. По клику на кнопку проверьте, накладываются ли эти дивы друга на друга или нет.

//* =======================================================================

// №2

// Дана кнопка и ul. По клику на кнопку выведите список всех возможных счастливых билетов. Билет представляет собой строку из шести цифр, может быть с нулями спереди. Билет считается счастливым, если сумма сумма первых трех цифр равна сумме вторых трех цифр.

//* =======================================================================

// №3

// Напишите программу, которая сформирует следующий массив:

// [
// 	'x',
// 	'xx',
// 	'xxx',
// 	'xxxx',
// 	'xxxxx',
// ]

//* =======================================================================

// №4

// Дан такой объект:

// let data = {
// 	2018: {
// 		11: {
// 			29: [1, 2, 3],
// 			30: [4, 5],
// 		},
// 		12: {
// 			30: [6, 7],
// 			31: [8, 9],
// 		},
// 	},
// 	2019: {
// 		12: {
// 			29: [10, 11],
// 			30: [12, 13],
// 			31: [14, 15],
// 		}
// 	},
// }
// Запишите все элементы этого объекта в какой-нибудь массив, вот так:

// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]

//* =======================================================================

// Уровень 7.7 задачника JavaScript

//* =======================================================================

// №1

// Дан массив с числами. Подсчитайте общее количество цифр 3 во всех числах данного массива.

//* =======================================================================

// №2

// Напишите программу, которая сформирует следующий массив:

// [
// 	'1',
// 	'12',
// 	'123',
// 	'1234',
// 	'12345',
// ]

//* =======================================================================

// №3

// Дан массив:

// let affairs = [
// 	{
// 		date:  '2019-12-29',
// 		event: 'name1',
// 	},
// 	{
// 		date:  '2019-12-31',
// 		event: 'name2',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name3',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name4',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name5',
// 	},
// 	{
// 		date:  '2019-12-31',
// 		event: 'name6',
// 	},
// 	{
// 		date:  '2019-12-29',
// 		event: 'name7',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name8',
// 	},
// 	{
// 		date:  '2019-12-30',
// 		event: 'name9',
// 	},
// ]
// Получите из этого массива уникальные даты, то есть вот так:

// ['2019-12-29', '2019-12-30', '2019-12-31']

//* =======================================================================

// Уровень 7.8 задачника JavaScript

//* =======================================================================

// №1

// Дана кнопка и список ul. По клику на кнопку добавьте в конец каждой li ссылку, по нажатию на которую текст li будет перечеркиваться (но не текст ссылки).

//* =======================================================================

// №2

// Дан абзац, содержащий текст со словами. Сделайте так, чтобы по клику на любое слово из этого абзаца, это слово меняло порядок своих букв на обратный.

//* =======================================================================

// №3

// Дан следующий массив:

// let users = [
// 	{id: 1, name: 'user1', surn: 'surn1', age: 30},
// 	{id: 2, name: 'user2', surn: 'surn2', age: 31},
// 	{id: 3, name: 'user3', surn: 'surn3', age: 32},
// ];
// Выведите элементы этого массива в виде таблицы table так, чтобы каждое поле объекта попало в свой тег td. Сделайте заголовки колонок вашей таблицы.

//* =======================================================================

// №4

// Напишите программу, которая сформирует следующий массив:

// [
// 	'1',
// 	'12',
// 	'123',
// 	'1234',
// 	'12345',
// 	'1234',
// 	'123',
// 	'12',
// 	'1',
// ]

//* =======================================================================

// Уровень 7.9 задачника JavaScript

//* =======================================================================

// №1

// Дан абзац и инпут. В абзаце через пробел написаны слова. В инпут вводится некоторое слово. По потери фокуса проверьте, есть ли такое слово в абзаце, и если нет - добавьте его.

//* =======================================================================

// №2

// Напишите программу, которая сформирует следующую строку:

// '-1-12-23-34-45-'

//* =======================================================================

// №3

// Напишите программу, которая сформирует следующий массив:

// [
// 	12,
// 	34,
// 	56,
// 	78,
// 	90,
// ]

//* =======================================================================

// №4

// Дан следующая верстка:

// <a href="1.html">111</a>
// <a href="2.html">222</a>
// <a href="3.html">222</a>
// Получите содержимое адресов и текстов ссылок в виде следующей структуры:

// [
// 	{
// 		text: '111',
// 		href: '1.html',
// 	},
// 	{
// 		text: '222',
// 		href: '2.html',
// 	},
// 	{
// 		text: '333',
// 		href: '3.html',
// 	},
// ]

//* =======================================================================

// Уровень 7.10 задачника JavaScript

//* =======================================================================

// №1

// Напишите программу, которая сформирует следующую строку:

// '-x-xx-xxx-xx-x-'

//* =======================================================================

// №2

// Напишите программу, которая сформирует следующую строку:

// '11 12 13 21 22 23 31 32 33'

//* =======================================================================

// №3

// Даны дивы с названиями продуктов и ценами. Дан также абзац. Сделайте так, чтобы кликами можно было выбрать несколько продуктов и их суммарная стоимость при этом писалась бы в абзац.

//* =======================================================================

// №4

// Дана таблица прямоугольного размера с нечетным количеством рядов и колонок.Дана кнопка.По клику на кнопку выделите каким - нибудь цветом центральную ячейку.

//* =======================================================================
