//! =======================================================================

//; Уровень 8.1 задачника JavaScript

//! =======================================================================

//? №1
//? Дан массив:
//? [
//? 	[1, 2, 3],
//? 	[1, 2],
//? 	[1, 2, 3, 4, 5],
//? 	[1],
//? 	[1, 2, 3, 4],
//? ]
//? Отсортируйте элементы массива по возрастанию количества элементов в подмассиве.

// const arr = [[1, 2, 3], [1, 2], [1, 2, 3, 4, 5], [1], [1, 2, 3, 4]];
// const arr1 = arr.toSorted((a, b) => a.length - b.length);
// console.log(arr1);

//* =======================================================================

//? №2
//? Дан массив:
//? [
//? 	[2, 4, 5],
//? 	[1, 2, 3],
//? 	[0, 1, 1],
//? 	[5, 7, 1],
//? ]
//? Отсортируйте элементы массива по возрастанию суммы элементов подмассива.

// const arr = [
//   [2, 4, 5],
//   [1, 2, 3],
//   [0, 1, 1],
//   [5, 7, 1],
// ];
// const result = arr.toSorted(
//   (a, b) => a.reduce((z, num) => z + num, 0) - b.reduce((z, num) => z + num, 0),
// );
// console.log(result);

//* =======================================================================

//? №3
//? Выведите на экран следующую пирамидку:
//? x
//? xx
//? xxx
//? xxxx
//? xxxxx

// const div = document.querySelector('.div');
// const ul = document.createElement('ul');
// let x = '';
// for (let i = 1; i <= 5; i++) {
//   const li = document.createElement('li');
//   x = 'x'.repeat(i);
//   li.textContent = x;
//   ul.append(li);
// }
// div.append(ul);

//! =======================================================================

//; Уровень 8.2 задачника JavaScript

//! =======================================================================

//? №1
//? В текстареа вводится текст со словами. По потери фокуса сделайте таблицу, в первой колонке которой будут слова из текста, во второй колонке - количество раз, которое это слово встречается, а в третьей - процентное содержание этого слова в текста.

// const textarea = document.createElement('textarea');

// const div = document.querySelector('.div');
// div.append(textarea);

// textarea.addEventListener('blur', () => {
//   const oldTable = document.querySelector('table');
//   if (oldTable) {
//     oldTable.remove();
//   }
//   const text = textarea.value.trim();
//   if (text === '') return;
//   const arrTextFull = text.match(/[а-яёіїєґa-z]+/gi) ?? [];
//   if (arrTextFull.length === 0) return;
//   const arrText = [...new Set(arrTextFull)];

//   const table = document.createElement('table');
//   for (let i = 0; i < arrText.length; i++) {
//     const tr = document.createElement('tr');

//     for (let j = 1; j <= 3; j++) {
//       const td = document.createElement('td');
//       let str = arrText[i];
//       const count = arrTextFull.filter(item => item === str).length;
//       if (j === 1) {
//         td.textContent = str;
//         tr.append(td);
//       }
//       if (j === 2) {
//         td.textContent = count;
//         tr.append(td);
//       }
//       if (j === 3) {
//         const res = (count / arrTextFull.length) * 100;
//         td.textContent = `${Math.round(res)}%`;
//         tr.append(td);
//       }
//     }
//     table.append(tr);
//   }
//   div.append(table);
// });

//* =======================================================================

//? №2
//? Дан список ul и кнопка. По нажатию на кнопку отсортируйте пункты списка по возрастанию.

// const ul = document.createElement('ul');
// ul.innerHTML = `
// <li>Пункт 144</li>
// <li>Пункт 24</li>
// <li>Пункт 30</li>
// <li>Пункт 4</li>
// <li>Пункт 10</li>
// `;
// const btn = document.createElement('button');
// btn.textContent = 'відсортировати';
// const div = document.querySelector('.div');
// div.append(ul, btn);
// btn.addEventListener('click', headers);
// function headers() {
//   const arr = [...ul.querySelectorAll('li')].toSorted(
//     (a, b) =>
//       Number(a.textContent.match(/\d+/)[0]) -
//       Number(b.textContent.match(/\d+/)[0]),
//   );
//   ul.append(...arr);
// }

//* =======================================================================

//? №3
//? Дан массив, подмассивы которого содержат цифры:
//? [
//? 	[1, 2, 3],
//? 	[4, 5, 6],
//? 	[7, 8, 9],
//? ]
//? Слейте элементы этого массива в числа:
//? [123, 456, 789]

// const arr = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// const result = arr.map(item => Number(item.join('')));
// console.log(result);

//* =======================================================================

//? №4
//? Выведите на экран следующую пирамидку:
//? xx
//? xxxx
//? xxxxxx
//? xxxxxxxx
//? xxxxxxxxxx

// const ul = document.createElement('ul');
// for (let i = 2; i < 11; i += 2) {
//   const li = document.createElement('li');
//   li.textContent = 'x'.repeat(i);
//   ul.append(li);
// }
// const div = document.querySelector('.div');
// div.append(ul);

//! =======================================================================

//; Уровень 8.3 задачника JavaScript

//! =======================================================================

//? №1
//? Пусть даны чекбоксы, отмеченные и нет. По нажатию на кнопку сделайте так, чтобы все чекбоксы сменили свое состояние.

// const arr = [
//   'Перший',
//   'Другий',
//   'Третій',
//   'чотвертий',
//   "п'ятий",
//   'шостий',
//   'сьомий',
//   'восьмий',
//   "дев'ятий",
//   'десятий',
// ];
// const ul = document.createElement('ul');
// arr.forEach(text => {
//   const li = document.createElement('li');
//   const input = document.createElement('input');
//   input.type = 'checkbox';
//   const label = document.createElement('label');
//   label.append(input, text);
//   li.append(label);
//   ul.append(li);
// });
// const btn = document.createElement('button');
// btn.textContent = 'Змінити';
// const div = document.querySelector('.div');
// div.append(ul, btn);

// btn.addEventListener('click', change);
// function change() {
//   ul.querySelectorAll('input').forEach(item => {
//     item.checked = !item.checked;
//   });
// }

//* =======================================================================

//? №2
//? Дан следующий массив:
//? let arr = [1, 2, 3, 4, 5, 6];
//? Дано также число:
//? let num = 3;
//? Добавьте в приведенный массив столько пустых строк, чтобы длина массива стала равна квадрату числа из переменной.

// let arr = [1, 2, 3, 4, 5, 6];
// let num = 3;
// const numLength = num * num - arr.length;
// if (numLength > 1) {
//   for (let i = 0; i < numLength; i++) {
//     arr.push('');
//   }
// }
// console.log(arr);

//* =======================================================================

//? №3
//? Выведите на экран следующую пирамидку:
//? 111
//? 222
//? 333
//? 444
//? 555
//? 666
//? 777
//? 888
//? 999

// const arr = [];
// for (let i = 1; i <= 9; i++) {
//   arr.push(String(i).repeat(3));
// }
// const ul = document.createElement('ul');
// arr.forEach(num => {
//   const li = document.createElement('li');
//   li.textContent = num;
//   ul.append(li);
// });
// const div = document.querySelector('.div');
// div.append(ul);

//! =======================================================================

//; Уровень 8.4 задачника JavaScript

//! =======================================================================

//? №1
//? Дана кнопка и блок с текстом. Текст по высоте не влазит в блок и скрыт. По клику на кнопку распахните блок на всю высоту.

// const btn = document.createElement('button');
// btn.textContent = 'more';
// const text = document.createElement('p');
// text.style.maxHeight = '100px';
// text.style.overflow = 'hidden';
// text.textContent =
//   'Дана кнопка и блок с текстом. Текст по высоте не влазит в блок и скрыт. По клику на кнопку распахните блок на всю высоту.';
// const block = document.createElement('div');
// block.style.maxWidth = '200px';
// block.style.height = '100px';
// block.append(text);
// const div = document.querySelector('.div');
// div.append(btn, block);

// btn.addEventListener('click', more);
// function more() {
//   block.style.height === 'auto'
//     ? (block.style.height = '100px')
//     : (block.style.height = 'auto');
//   text.style.maxHeight === 'none'
//     ? (text.style.maxHeight = '100px')
//     : (text.style.maxHeight = 'none');
//   btn.textContent === 'more'
//     ? (btn.textContent = 'less')
//     : (btn.textContent = 'more');
// }

//* =======================================================================

//? №2
//? Дана строка с текстом. Получите процентное содержание каждого символа текста в виде объекта, в котором ключами будут символы, а значениями - их процентное содержание.

// const str = 'Дана строка с текстом.';
// const arr = str.split('');
// const result = {};

// arr.forEach(item => {
//   result[item] =
//     ((arr.filter(n => item === n).length / arr.length) * 100)
//       .toFixed()
//       .padStart(2, '0') + '%';
// });

// console.log(result);

//* =======================================================================

//? №3
//? Дан список ul и инпут. По мере ввода текста в инпут оставляйте видимыми только те li, текст которых начинается на текст, введенный в инпут.

// const ul = document.createElement('ul');
// ul.innerHTML = `
//   <li>Яблоко</li>
//   <li>Абрикос</li>
//   <li>Апельсин</li>
//   <li>Ананас</li>
//   <li>Банан</li>
//   <li>Брусника</li>
//   <li>Виноград</li>
//   <li>Вишня</li>
//   <li>Груша</li>
//   <li>Гранат</li>
//   <li>Дыня</li>
//   <li>Персик</li>
//   <li>Слива</li>
//   <li>Черешня</li>
// `;
// const input = document.createElement('input');
// const div = document.querySelector('.div');
// div.append(ul, input);

// input.addEventListener('input', filt);
// function filt(e) {
//   const value = e.target.value.trim().toLowerCase();

//   ul.querySelectorAll('li').forEach(item => {
//     item.style.display = item.textContent.toLowerCase().startsWith(value)
//       ? ''
//       : 'none';
//   });
// }

//* =======================================================================

//? №4
//? Выведите на экран следующую пирамидку:
//? 1
//? 22
//? 333
//? 4444
//? 55555
//? 666666
//? 7777777
//? 88888888
//? 999999999

// const ul = document.createElement('ul');
// for (let i = 1; i < 10; i++) {
//   const li = document.createElement('li');
//   li.textContent = String(i).repeat(i);
//   ul.append(li);
// }
// const div = document.querySelector('.div');
// div.append(ul);

//* =======================================================================

//? №5
//? Дан список городов и их стран, хранящийся в следующей структуре:
//? let data = [
//? 	{
//? 		country: 'country1',
//? 		city:    'city11',
//? 	},
//? 	{
//? 		country: 'country2',
//? 		city:    'city21',
//? 	},
//? 	{
//? 		country: 'country3',
//? 		city:    'city31',
//? 	},
//? 	{
//? 		country: 'country1',
//? 		city:    'city12',
//? 	},
//? 	{
//? 		country: 'country1',
//? 		city:    'city13',
//? 	},
//? 	{
//? 		country: 'country2',
//? 		city:    'city22',
//? 	},
//? 	{
//? 		country: 'country3',
//? 		city:    'city31',
//? 	},
//? ]
//? Напишите код, которой переделает структуру данных вот в такую:
//? {
//? 	'country1': [
//? 		'city11', 'city12', 'city13',
//? 	],
//? 	'country2': [
//? 		'city21', 'city22'
//? 	],
//? 	'country3': [
//? 		'city31', 'city32'
//? 	],
//? }

let data = [
  {
    country: 'country1',
    city: 'city11',
  },
  {
    country: 'country2',
    city: 'city21',
  },
  {
    country: 'country3',
    city: 'city31',
  },
  {
    country: 'country1',
    city: 'city12',
  },
  {
    country: 'country1',
    city: 'city13',
  },
  {
    country: 'country2',
    city: 'city22',
  },
  {
    country: 'country3',
    city: 'city31',
  },
];

//* =======================================================================

// Уровень 8.5 задачника JavaScript

//* =======================================================================

// №1
// Дан массив со словами. Выведите слова, начинающиеся на одинаковые буквы в своем отдельном списке ul. Над каждым списком сделайте h2 с названием буквы, для которой сделан список.

//* =======================================================================

// №2
// Даны три селекта. В первом селекте выведите дни месяца от 1 до 31, во втором - названия месяцев года, а в третьем - года за предыдущие и следующие 10 лет.

//* =======================================================================

// №3
// Модифицируйте предыдущую задачу так, чтобы по умолчанию в селектах была выбрана текущая дата.

//* =======================================================================

// №4
// Модифицируйте предыдущую задачу так, чтобы в первом селекте количество дней соответствовало выбранному месяцу и году.

//* =======================================================================

// №5
// Выведите на экран следующую пирамидку:
// 1
// 333
// 55555
// 7777777
// 999999999

//* =======================================================================

// Уровень 8.6 задачника JavaScript

//* =======================================================================

// №1
// Дан абзац с текстом и кнопка. По клику на кнопку покрасьте каждый символ в случайный цвет так, чтобы у соседних символов были разные цвета.

//* =======================================================================

// №2
// Дан абзац со словами и инпут. В инпут вводится слово. По клику на кнопку найдите это слово в абзаце и покрасьте его в красный цвет.

//* =======================================================================

// №3
// Дано меню со ссылками. Покрасьте в красный цвет ту ссылку, адрес которой совпадает с URL из адресной строки браузера.

//* =======================================================================

// №4
// Выведите на экран следующую пирамидку:
// xxxxx
// xxxx
// xxx
// xx
// x

//* =======================================================================

// №5
// Дан список событий за определенные даты, хранящийся в следующей структуре:
// let events = [
// 	{
// 		date:  '2019-12-29'
// 		event: 'name1'
// 	},
// 	{
// 		date:  '2019-12-31'
// 		event: 'name2'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name3'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name4'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name5'
// 	},
// 	{
// 		date:  '2019-12-31'
// 		event: 'name6'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name7'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name8'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name9'
// 	},
// ]
// Напишите код, которой переделает структуру данных вот в такую:

// {
// 	'2019-12-29': ['name1', 'name3', 'name5', 'name7'],
// 	'2019-12-30': ['name4', 'name8', 'name9'],
// 	'2019-12-31': ['name2', 'name6'],
// }

//* =======================================================================

// Уровень 8.7 задачника JavaScript

//* =======================================================================

// №1
// Дано слово. Перемешайте буквы этого слова в случайном порядке.

//* =======================================================================

// №2
// Дан инпут, кнопка и список ul. В инпут вводится число. По клику на кнопку выведите список всех возможных вариантов разложения числа на два множителя.

//* =======================================================================

// №3
// На странице через абсолютное позиционирование расположены дивы, могущие накладываться друг на друга. По клику на любой див сделайте так, чтобы он стал поверх остальных.

//* =======================================================================

// №4
// Выведите на экран следующую пирамидку:
// 999999999
// 88888888
// 7777777
// 666666
// 55555
// 4444
// 333
// 22
// 1

//* =======================================================================

// №5
// Дан список событий за определенные даты, хранящийся в следующей структуре:
// let events = {
// 	'2019-12-29': ['name1', 'name3', 'name5', 'name7'],
// 	'2019-12-30': ['name4', 'name8', 'name9'],
// 	'2019-12-31': ['name2', 'name6'],
// }
// Напишите код, которой переделает структуру данных вот в такую:
// let events = [
// 	{
// 		date:  '2019-12-29'
// 		event: 'name1'
// 	},
// 	{
// 		date:  '2019-12-31'
// 		event: 'name2'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name3'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name4'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name5'
// 	},
// 	{
// 		date:  '2019-12-31'
// 		event: 'name6'
// 	},
// 	{
// 		date:  '2019-12-29'
// 		event: 'name7'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name8'
// 	},
// 	{
// 		date:  '2019-12-30'
// 		event: 'name9'
// 	},
// ]

//* =======================================================================

// Уровень 8.8 задачника JavaScript

//* =======================================================================

// №1
// Даны два селекта. В первом селекте выводятся страны. Сделайте так, чтобы во втором селекте выводились города выбранной страны.

//* =======================================================================

// №2
// Даны инпут и кнопка. В инпут вводится число. По клику на кнопку, проверьте, является ли это число совершенным.

//* =======================================================================

// №3
// Дан список событий за определенные месяцы, хранящийся в следующей структуре:
// let events = [
// 	{
// 		date:  '2019-12'
// 		event: 'name1'
// 	},
// 	{
// 		date:  '2019-12'
// 		event: 'name2'
// 	},
// 	{
// 		date:  '2019-11'
// 		event: 'name3'
// 	},
// 	{
// 		date:  '2019-11'
// 		event: 'name4'
// 	},
// 	{
// 		date:  '2020-10'
// 		event: 'name5'
// 	},
// 	{
// 		date:  '2020-10'
// 		event: 'name6'
// 	},
// 	{
// 		date:  '2020-11'
// 		event: 'name5'
// 	},
// 	{
// 		date:  '2020-11'
// 		event: 'name6'
// 	},
// 	{
// 		date:  '2020-12'
// 		event: 'name7'
// 	},
// 	{
// 		date:  '2020-12'
// 		event: 'name8'
// 	},
// 	{
// 		date:  '2020-12'
// 		event: 'name9'
// 	},
// ]
// Напишите код, которой переделает структуру данных вот в такую:

// {
// 	2019: {
// 		11: [массив событий],
// 		12: [массив событий],
// 	}
// 	2020: {
// 		10: [массив событий],
// 		11: [массив событий],
// 		12: [массив событий],
// 	}
// }

//* =======================================================================

// Уровень 8.9 задачника JavaScript

//* =======================================================================

// №1
// Дано меню со ссылками. Сделайте так, чтобы по клику на ссылку меню под ней выпадало подменю.

//* =======================================================================

// №2
// Дан абзац со словами и кнопка. По клику на кнопку покрасьте каждое слово в случайный цвет так, чтобы у соседних абзацев были разные цвета.

//* =======================================================================

// №3
// Дан див. У этого дива есть крестик закрытия. Сделайте так, чтобы по клику на крестик, либо на любое место страницы вне дива, этот див прятался.

//* =======================================================================

// №4
// Дан текстареа и ul. В текстареа вводится текст. Сделайте так, чтобы по нажатию Shift + Enter каждая строка текста добавилась в список в виде отдельного тега li.

//* =======================================================================

// №5
// Дан такой список дел за определенную дату:
// let affairs = {
// 	'2019-12-31': ['массив дел'],
// 	'2018-11-29': ['массив дел'],
// 	'2018-11-30': ['массив дел'],
// 	'2018-12-27': ['массив дел'],
// 	'2019-12-29': ['массив дел'],
// 	'2019-12-30': ['массив дел'],
// 	'2018-12-30': ['массив дел'],
// 	'2018-12-31': ['массив дел'],
// }
// Выведите на экран все дела за 2018 год.

//* =======================================================================

// Уровень 8.10 задачника JavaScript

//* =======================================================================

// №1
// Даны два инпута и кнопка. В инпуты вводятся числа. По клику на кнопку, проверьте, являются ли эти числа дружественными или нет.

//* =======================================================================

// №2
// Дан некоторый массив:
// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
// Дана переменная:
// let n = 3;
// Превратите этот массив в двухмерный, по n элементов в подмассиве.

//* =======================================================================

// №3
// Дан массив:
// [
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3],
// 	[1, 2],
// ]
// Добавьте в каждый подмассив столько пустых строк, чтобы количество элементов в каждом подмассиве стало равно количеству элементов в самом длинном подмассиве.

//* =======================================================================
