// Уровень 9.1 задачника JavaScript
// №1

// Дан текст со знаками препинаний. Получите массив предложений этого текста.

// №2

// Всем ссылкам, ведующим на чужой сайт, добавьте target="_blank".

// №3

// Дана некоторая строка:

// let str = 'abcde abcde'
// В переменной хранятся символы:

// let del = 'abe';
// Удалите из строки все указанные в переменной символы. В нашем случае должно получится следующее:

// 'cd cd'




// Уровень 9.2 задачника JavaScript
// №1

// Дан список ul и кнопка. По нажатию на кнопку перемешайте пункты списка в случайном порядке.

// №2

// Два числа делятся друг на друга, в результате получается периодическая дробь. Напишите код, который определит период этой дроби.

// №3

// Дан инпут, абзац и кнопка. В инпут вводится целое число. По нажатию на кнопку выведите в абзац разложение этого числа на простые множители.

// №4

// Даны два инпута и кнопка.По клику на кнопку выведите список список ul всех простых чисел из промежутка, заданном значениями инпутов.






// Уровень 9.3 задачника JavaScript
// №1

// Дан массив со словами. Получите из этого массива случайное слово, начинающееся на заданную букву.

// №2

// Пусть у нас есть дата 22.02.2017. В этой дате 4 двойки. Найдите все даты с 4-мя двойками в текущем столетии.

// №3

// Дан массив с точками:

// [
// 	[1, 2], [2, 4], [3, 8], [4, 16], [5, 32]
// ]
// Отрисуйте эти точки на графике.




// Уровень 9.4 задачника JavaScript
// №1

// Дана таблица. По нажатию на кнопку добавьте в эту таблицу новый ряд.

// №2

// Дана таблица. По нажатию на кнопку добавьте в эту таблицу новую колонку.

// №3

// Дана таблица. По нажатию на кнопку добавьте в эту таблицу и новый ряд, и новую колонку.

// №4

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в ней появлялся инпут для редактирования этой ячейки.

// №5

// Дана таблица и кнопка. По нажатию на кнопку покрасьте в красный цвет случайную ячейку таблицы. Повторное нажатие на кнопку должно закрашивать новую незакрашенную ячейку, пока ячейки не закончатся.

// №6

// Дана таблица и кнопка. Пусть каждое нажатие на кнопку красит в красный цвет следующую по порядку ячейку таблицы.

// №7

// Выведите на экран 6 случайных картинок игральных карт.




// Уровень 9.5 задачника JavaScript
// №1

// Дан селект и радио кнопочки, количество радио равно количеству пунктов в селекте. Сделайте так, чтобы при выборе пункта в селекте автоматически становилась отмеченной соответствующая радио кнопочка.

// №2

// Дана таблица. По нажатию на кнопку выделите в таблице красным цветом N случайных ячеек.

// №3

// Дан массив:

// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
// Дан инпут и кнопка.В инпут вводится число.По нажатию на кнопку создайте таблицу, заполненную данными из этого массива, содержащую столько колонок, сколько указано в инпуте.




// Уровень 9.6 задачника JavaScript
// №1

// Сгенерируйте таблицу, покрашенную в виде шахматной доски.

// №2

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в нее писался ее порядковый номер в таблице.

// №3

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в нее писался номер ее ряда и колонки в таблице.

// №4

// Дано пять чебоксов. Сделайте так, чтобы одновременно можно было отметить не более трех из них.

// №5

// Дан следующий массив:

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
// Из приведенного массива динамически создайте таблицу размером в 5 колонок.





// Уровень 9.7 задачника JavaScript
// №1

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в красный цвет красился ряд с этой ячейкой.

// №2

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в красный цвет красилась колонка с этой ячейкой.

// №3

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку удалялся ряд с этой ячейкой.

// №4

// Дана таблица. Сделайте так, чтобы по клику на любую удалялась колонка с этой ячейкой.

// №5

// Дана таблица и кнопка.По клику на кнопку покрасьте в красный цвет ячейки, расположенные на диагонали таблицы.




// Уровень 9.8 задачника JavaScript
// №1

// Дана таблица и кнопка. По клику на кнопку поменяйте местами первый и второй ряд таблицы.

// №2

// Дана таблица и кнопка. По клику на кнопку поменяйте местами первую и вторую колонки таблицы.

// №3

// Дана таблица. По клику на заголовок любой колонки отсортируйте таблицу по значениям ячеек этой колонки.

// №4

// Дана таблица.Сделайте так, чтобы при кликах на любую яейку таблицы в нее по очереди вставлялись числа 1, 2 и 3.




// Уровень 9.9 задачника JavaScript
// №1

// Дана таблица. Сделайте так, чтобы по клику на любую ячейку в этой ячейке появлялся порядковый номер клика.

// №2

// Дана таблица, заполненная числами по порядку и кнопка. По нажатию на кнопку перемешайте числа в таблице.

// №3

// Дан текстареа. В него вводится текст. По потери фокуса найдите самый часто используемый символ этого текста и выведите его в абзац.

// №4

// Даны инпуты. Поставьте первому инпуту в value число 1, через секунду второму число 2, еще через секунду третьему число 3 и так далее пока инпуты не закончатся. Когда инпуты закончатся продолжите нумерацию с первого инпута.

// №5

// Сделайте функцию, которая будет принимать число, а возвращать это число прописью. Пусть функция работает с числами до 999. Смотрите пример:

// func(123); // выведет 'сто двадцать три'


// Уровень 9.10 задачника JavaScript
// №1

// Дана таблица. Юзер кликает по очереди на две ячейки, выделяя их. Сделайте так, чтобы красным цветом выделились все ячейки, расположенные по порядку между теми, на которые кликнул юзер.

// №2

// Напишите код, который определит максимальный уровень вложенности многомерного массива.

// №3

// Дан список каких-то данных за определенные даты, хранящийся в следующей структуре:

// let data = [
// 	{
// 		year:  2019,
// 		month: 11,
// 		day: 20,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2019,
// 		month: 11,
// 		day: 21,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2019,
// 		month: 12,
// 		day: 25,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2019,
// 		month: 12,
// 		day: 26,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2020,
// 		month: 10,
// 		day: 29,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2020,
// 		month: 10,
// 		day: 30,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2020,
// 		month: 11,
// 		day: 19,
// 		data: ['массив с данными']
// 	},
// 	{
// 		year:  2020,
// 		month: 11,
// 		day: 20,
// 		data: ['массив с данными']
// 	},
// }
// Напишите код, которой переделает структуру данных в структуру вида:

// {
// 	год1: {
// 		месяц1: {
// 			день1: [массив данных],
// 			день2: [массив данных],
// 			день3: [массив данных],
// 		}
// 		месяц2: {
// 			день1: [массив данных],
// 			день2: [массив данных],
// 			день3: [массив данных],
// 		}
// 	}
// 	год2: {
// 		месяц1: {
// 			день1: [массив данных],
// 			день2: [массив данных],
// 			день3: [массив данных],
// 		}
// 		месяц2: {
// 			день1: [массив данных],
// 			день2: [массив данных],
// 			день3: [массив данных],
// 		}
// 	}
// }






