//**********************************************************/

//! Занимательные задачи JavaScript. Часть 1

//**********************************************************/

//? №1
//? Дан год:
//? let year = 2025;
//? Получите год начала и год конца столетия, соответствующий заданному году.

// let year = 2025;
// let start = Math.floor((year - 1) / 100) * 100 + 1;
// let end = start + 99;
// console.log(start, end);

//? №2
//? Определите, что год находится в интервале от 1900 до 2100 с помощью одного только регулярного выражения.

// const year = 2026;
// const result = /^(19\d{2}|20\d{2}|2100)$/.test(year);
// console.log(result);


//? №3
//? Даны два промежутка:
//? ['2025-03-11', '2025-10-30']
//? ['2025-05-11', '2026-12-31']
//? Получите даты начала и конца пересечения.




//? №4
//? Определите, что переданная строка является корректным временем вида 'часы:минуты'. Часы и минуты не должны выходить за диапазон времени.

//? №5

//? Удалите одной регуляркой все слова из предложения, содержащие две одинаковые следующие друг за другом буквы.

//? №6

//? Дано целое число:

//? let num = 100;
//? Разбейте его на два целых слагаемых случайным образом.

//? №7

//? Дана строка:

//? let str = 'abc de fghi jk';
//? Удалите из нее каждое второе слово.

//? №8

//? Дан текст:

//? let text = 'aaa bbb ccc aaa ddd bbb';
//? Получите объект, ключами которого будут символы, а значениями - их процентное содержание в тексте.

//? №9

//? Дан текст:

//? let text = 'aaa bbb ccc aaa ddd bbb';
//? Найдите символ, который наиболее часто встречается в этом тексте.

//? №10

//? Дана дата:

//? let date = '2025-12-31';
//? Проверьте, что эта дата корректная.

//!========================================================

// Занимательные задачи JavaScript. Часть 2
// №1

// Дано время:

// let time = '12:59:59';
// Проверьте, что это время корректное.

// №2

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Подсчитайте количество переносов строк в этом тексте.

// №3

// Даны два слова:

// let word1 = 'abcde';
// let word2 = 'fghij';
// Сделайте так, чтобы эти слова поменялись своими четными буквами.

// №4

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Узнайте количество знаков препинания в этом тексте.

// №5

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Найдите слово состоящее более чем из 3-х букв, которое встречается в этом тексте только один раз.

// №6

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Найдите все слова, где есть две одинаковые буквы, но не стоящие подряд.

// №7

// Придумайте, как хранить набор игральных карт в виде массива.

// №8

// Дан массив с картами:

// let cards = ['A♠', 'K♠', 'Q♠', 'J♠'];
// Проверьте, что все карты одной масти.

// №9

// Дан массив с картами:

// let cards = ['A♠', 'K♠', 'Q♠', 'J♠'];
// Получите минимальную карту из этого массива.

// №10

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Найдите все слова, где есть заданная буква, но не стоящая в начале или в конце слова.

//!========================================================
// Занимательные задачи JavaScript. Часть 3
// №1

// Дан массив с картами:

// let cards = ['A♠', 'K♠', 'Q♠', 'J♠'];
// Дана масть, которая является козырем. Дана карта, которой к вам походил противник. Получите минимальную карту из этого массива, с помощью которой можно отбить карту противника.

// №2

// Дан массив с картами:

// let cards = ['A♠', 'K♠', 'Q♠', 'J♠'];
// Проверьте, что в этом наборе карты идут подряд по возрастанию.

// №3

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Разбейте его на массив предложений.

// №4

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Напишите функцию, которая получит первые N слов из этого текста.

// №5

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Напишите функцию, которая получит первые N предложений из этого текста.

// №6

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Разбейте этот текст в многострочный так, чтобы в каждой строке было не более 100 символов и при этом не разрывались слова и не отрывались знаки препинания.

// №7

// Дана строка с математическими операциями:

// '2 + 3 * 5'
// Выполните операции и выведите результат.

// №8

// Дан текст со словами, среди которых встречаются емейлы:

// let text = 'aaa bbb test@mail.com ccc user@site.ru ddd';
// Напишите скрипт, который получит массив этих емейлов.

// №9

// Дана строка с математическими переменными и степенями:

// 'a^5 * b^2 * a^7 * b^3'
// Напишите программу, которая будет приводить это выражение в нормальную форму, в нашем случае вот такую: 'a^12*b^5'.

// №10

// Дана строка с текстом:

// let str = 'aaa bbb ccc ddd';
// Получите из этой строки массив, содержащий время, в котором минуты равны секундам.
//!========================================================
// Занимательные задачи JavaScript. Часть 4
// №1

// Дана дата:

// let date = '31.12.2025';
// Напишите скрипт, который выведет список дней от заданной даты на N дней вперед, прибавляя по одному дню.

// №2

// Дана строка с текстом, среди которого встречается время в формате '12:59':

// let str = 'aaa 12:21 bbb 12:12 ccc 12:59 ddd';
// Получите из этой строки массив, содержащий время, в котором часы и минуты состоят из тех же цифр, но в обратном порядке. Например, вот такое время: '12:21'.

// №3

// Дана строка с текстом:

// let str = 'aaa bbb ccc ddd';
// Напишите скрипт, который найдет в тексте эти даты и сменит им формат на '31.12.2025'.

// №4

// Дана строка с текстом, среди которого встречается время в формате '12:59':

// let str = 'aaa 12:21 bbb 12:12 ccc 12:59 ddd';
// Получите из этой строки массив, содержащий время, в котором часы и минуты состоят из тех же цифр. Например, мы берем и время '12:12', и время '12:21'.

// №5

// Дана дата:

// let date = '31.12.2025';
// Напишите скрипт, который выведет список дней от заданной даты на N дней вперед, прибавляя по одному дню, но не включая в этот список выходные дни.

// №6

// Дана строка:

// let str = 'abc de fghi jk';
// Найдите позицию третьего знака препинания.

// №7

// Дана дата:

// let date = '2025-12-31';
// Отнимите от нее 3 дня и выведите ее в таком же формате.

// №8

// Дана строка со скобками:

// '((2 * 3) + 1)'
// Проверьте корректность расстановки скобок: количество открывающий должно быть равно количеству закрывающих: '(2 + 3))' - некорретно, их порядок должен быть правильным: ')(2 + 3))' - некорретно.

// №9

// Дано число с нечетным количеством цифр:

// let num = 12345;
// Получите центральную цифру из этого числа.

// №10

// Дана строка:

// let str = 'abc de fghi jk';
// Смените регистр всех букв в ней.
//!========================================================
// Занимательные задачи JavaScript. Часть 5
// №1

// Дан путь:

// let path = '/aaa/bbb/ccc/';
// Получите последний сегмент пути. В нашем случае это будет '/ccc/'.

// №2

// Дан путь:

// let path = '/aaa/bbb/ccc/';
// Поменяйте заданный сегмент пути на новое значение. К примеру, поменяем второй сегмент пути: '/aaa/+++/ccc/'

// №3

// Дан путь:

// let path = '/1/2/3/';
// Увеличьте заданный сегмент пути на единицу. К примеру, увеличим второй сегмент пути: '/1/3/3/'

// №4

// Дан путь:

// let path = '/aaa/bbb/ccc/';
// Получите из пути имя файла с его расширением, если это возможно.

// №5

// Пусть в первом сегменте адреса задается язык пользователя: '/ru/bbb/ccc/'. Напишите программу, которая получит этот язык.

// №6

// Дан массив:

// [
//     [1, 2, 3],
//     [1, 2],
//     [1, 2, 3, 4, 5],
//     [1],
//     [1, 2, 3, 4],
// ]
// Отсортируйте элементы массива по возрастанию количества элементов в подмассиве.

// №7

// Дан массив:

// [
//     [2, 4, 5],
//     [1, 2, 3],
//     [0, 1, 1],
//     [5, 7, 1],
// ]
// Отсортируйте элементы массива по возрастанию суммы элементов подмассива.

// №8

// Выведите на экран следующую пирамидку:

// x
// xx
// xxx
// xxxx
// xxxxx
// №9

// Дан массив, подмассивы которого содержат цифры:

// [
//     [1, 2, 3],
//     [4, 5, 6],
//     [7, 8, 9],
// ]
// Слейте элементы этого массива в числа:

// [123, 456, 789]
// №10

// Выведите на экран следующую пирамидку:

// xx
// xxxx
// xxxxxx
// xxxxxxxx
// xxxxxxxxxx
//!========================================================
// Занимательные задачи JavaScript. Часть 6
// №1

// Дан следующий массив:

// let arr = [1, 2, 3, 4, 5, 6];
// Дано также число:

// let num = 3;
// Добавьте в приведенный массив столько пустых строк, чтобы длина массива стала равна квадрату числа из переменной.

// №2

// Выведите на экран следующую пирамидку:

// 111
// 222
// 333
// 444
// 555
// 666
// 777
// 888
// 999
// №3

// Сделайте функцию, которая будет принимать число, а возвращать это число прописью. Пусть функция работает с числами до 999.

// Смотрите пример:

// func(123); // выведет 'сто двадцать три'
// №4

// Сделайте функцию, которая параметром будет принимать английское существительное в единственном числе и возвращать его во множественном числе.

// №5

// Даны два числа:

// let a = 12;
// let b = 34;
// Выведите на экран процесс умножения этих чисел в столбик, как в школе.

// №6

// Дан текст со словами:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Перемешайте все слова этого текста в случайном порядке.

// №7

// Даны два числа:

// let a = 12;
// let b = 34;
// Выведите на экран процесс нахождения НОК, как в школе.

// №8

// Даны два числа:

// let a = 12;
// let b = 34;
// Выведите на экран процесс нахождения НОД, как в школе.

// №9

// Удалите из массива все элементы, являющиеся пустыми строками.

// Пример:

// [1, '', 2, '', '', 3]
// №10

// Дан двухмерный массив:

// let users = [
//     {
//         'name': 'john',
//         'surn': 'smit',
//     },
//     {
//         'name': 'john',
//         'surn': 'book',
//     },
//     {
//         'name': 'eric',
//         'surn': 'smit',
//     },
// ];
// Удалите из этого массива подмассивы-дубли, имеющие совпадение по заданному полю, в нашем случае, по name или surn.
//!========================================================
// Занимательные задачи JavaScript. Часть 7
// №1

// Даны два числа:

// let a = 12;
// let b = 34;
// Проверьте что эти числа состоят из одинакового набора цифр. Иначе говоря, проверьте то, что перестановкой цифр одного числа можно получить другое число.

// №2

// Дано число:

// let num = 12.345;
// Узнайте, сколько знаков у него в дробной части.

// №3

// Создайте массив следующего вида:

// [ 1, [2], [[3]], [­[[4]]], [[[[5]]]] ]
// Массив может быть произвольной длины.

// №4

// Дана строка с цифрами:

// '12345678'
// Просуммируйте числа этой строки вот таким образом: 12+34+56+78. Строка, конечно же, может быть произвольной (но только с цифрами внутри).

// №5

// Дана папка с файлами и подпапками, в подпапках могут быть свои подпапки и файлы и так далее. Выведите на экран пути ко всем файлам, расположенных в этих папках.

// №6

// Дана строка с текстом:

// let str = 'aaa bbb ccc ddd';
// Выведите на экран самое длинное слово из этого текста (или слова, если несколько слов имеют одинаковую длину).

// №7

// Дан массив с числами:

// let arr = [1, 2, 3, 4, 5];
// Проверьте, что элементы этого массива идут по возрастанию или убыванию чисел.

// №8

// Сделайте функцию, которая будет удалять элементы из массива по заданному значению.

// №9

// Дан массив:

// let arr = [1, '', 2, '', '', 3];
// Перетосуйте его элементы случайным образом, не пользуясь стандартной функцией shuffle.
//!========================================================

// Занимательные задачи JavaScript. Часть 8
// №1

// Lorem ipsum - это генератор псевдолатыни для заполнения страниц сайта. Напишите функцию, которая будет генерировать русский псевдотекст.

// №2

// Найдите сумму целых чисел от 1 до 1000000 самым незатратным по ресурсам и самым быстро работающим способом.

// №3

// Сделайте функцию, которая будет принимать промежуток времени в формате '1 день 3 часа 10 минут 21 секунда', и возвращать количество секунд, соответствующего указанному промежутку.

// №4

// Найдите все числа от 1 до 1000000, которые делятся на все числа от 1 до 9.

// №5

// Даны два массива:

// [1, 2, 3]
// ['a', 'b', 'c']
// Слейте их вместе таким образом:

// [1, 'a', 2, 'b', 3, 'c']
// №6

// Сделайте функцию, которая принимает дату в формате '2014-12-31', а возвращает знак зодиака в этот день.
//!========================================================
// Занимательные задачи JavaScript. Часть 9
// №1

// Числа Фибоначчи представляют собой последовательность, в которой первые два числа равны 0 и 1, а каждое последующее число равно сумме двух предыдущих чисел. Получите первые N чисел Фибоначчи.

// №2

// Дана папка с файлами и подпапками.

// Получите размер этой папки в мегабайтах.

// №3

// Дан некоторый URL:

// let url = 'http://test.com/dir1/dir2/dir3/page.html';
// Получите из него имя домена:

// 'test.com'
// №4

// Дан некоторый URL:

// let url = 'http://test.com/dir1/dir2/dir3/page.html';
// Получите из него имя страницы:

// 'page.html'
// №5

// Дан некоторый URL:

// let url = 'http://test.com/dir1/dir2/dir3/page.html';
// Получите из него папки в виде массива:

// ['dir1', 'dir2', 'dir3']
// №6

// Сгенерируйте три селекта. В первом селекте выведите дни месяца от 1 до 31, во втором - названия месяцев года, а в третьем - года за предыдущие и следующие 10 лет. Сделайте так, чтобы по умолчанию в селектах была выбрана текущая дата.

// №7

// Дано меню со ссылками:

// <a href="/page1.html">page1</a>
// <a href="/page2.html">page2</a>
// <a href="/page3.html">page3</a>
// Покрасьте в красный цвет ту ссылку, адрес которой совпадает с URL из адресной строки браузера.

// №8

// Дан такой список дел за определенную дату:

// let affairs = {
// 	'2019-12-31': ['массив дел'],
// 	'2018-11-29': ['массив дел'],
// 	'2018-11-30': ['массив дел'],
// 	'2018-12-27': ['массив дел'],
// 	'2019-12-29': ['массив дел'],
// 	'2019-12-30': ['массив дел'],
// 	'2018-12-30': ['массив дел'],
// 	'2018-12-31': ['массив дел'],
// };
// Выведите на экран все дела за 2018 год.

// №9

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Получите массив элементов его главной диагонали:

// [
//     11, 22, 33, 44, 55
// ]
// №10

// Дан файл с некоторой произвольной версткой, внутри которой расположены ссылки следующего вида:

// <div>
// 	text text text
// 	http://code.mu/ru/
// 	text text text
// 	https://code.mu/ru/
// </div>
// Прочитайте этот файл и отправьте в браузер его текст так, чтобы ссылки превратились в теги a:

// <div>
// 	text text text
// 	<a href="http://code.mu/ru/">code.mu/ru/</a>
// 	text text text
// 	<a href="https://code.mu/ru/">code.mu/ru</a>
// </div>
//!========================================================
// Занимательные задачи JavaScript. Часть 10
// №1

// Дана папка, содержащая картинки.

// По заходу на страницу выведите на экран случайную картинку из этой папки.

// №2

// Дан некоторый URL:

// let url = 'http://test.com/dir1/dir2/dir3/page.html';
// Получите из него последовательный набор папок:

// [
//     '/dir1/dir2/dir3/',
//     '/dir2/dir3/',
//     '/dir3/'
// ]
// №3

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Получите массив элементов его побочной диагонали:

// [
//     15, 24, 33, 42, 51
// ]
// №4

// Дан массив:

// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
// Дана форма с инпутом. В инпут вводится число. По отправки формы создайте таблицу, заполненную данными из этого массива, содержащую столько колонок, сколько указано в инпуте.

// №5

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Обнулите элементы его главной диагонали:

// [
//     [ 0, 12, 13, 14, 15],
//     [21,  0, 23, 24, 25],
//     [31, 32,  0, 34, 35],
//     [41, 42, 43,  0, 45],
//     [51, 52, 53, 54,  0],
// ]
// №6

// Сгенерируйте HTML таблицу, покрашенную в виде шахматной доски.

// №7

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Обнулите элементы, находящиеся ниже главной диагонали:

// [
//     [11, 12, 13, 14, 15],
//     [ 0, 22, 23, 24, 25],
//     [ 0,  0, 33, 34, 35],
//     [ 0,  0,  0, 44, 45],
//     [ 0,  0,  0,  0, 55],
// ]
// №8

// Дан некоторый URL:

// let url = 'http://test.com/dir1/dir2/dir3/page.html';
// Даны переменные:

// let num = 2;
// let val = 'eee';
// Замените в URL папку с номером num на значение val:

// 'http://test.com/dir1/eee/dir3/page.html'
// №9

// Сделайте сайт, по заходу отдающий случайное предсказание, хорошее или плохое. Предсказания должны хранится в БД. При обновлении страницы предсказание не должно меняться в течении текущего дня.

// №10

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Обнулите элементы, находящиеся не на диагоналях:

// [
//     [11,  0,  0,  0, 15],
//     [ 0, 22,  0, 24,  0],
//     [ 0,  0, 33,  0,  0],
//     [ 0, 42,  0, 44,  0],
//     [51,  0,  0,  0, 55],
// ]

//!========================================================

// Занимательные задачи JavaScript. Часть 11
// №1

// Определите дату следующего дня программиста. Этот день отмечается в 256 день года.

// №2

// Дан текст, разбитый на предложения:

// let text = 'Привет мир. Hello world. Как дела. How are you.';
// В тексте есть русские и английские слова. Напишите код, который получит массив предложений, состоящих только из русских слов.

// №3

// Дана папка.

// Подсчитайте количество файлов с расширением .html в этой папке.

// №4

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Напишите код, который перевернет каждое слово в этом тексте.

// №5

// Дана папка с файлами.

// Напишите код, который разложит эти файлы по папкам. В папку 1 первые 10 файлов, в папку 2 вторые 10 файлов и так далее.

// №6

// Дан файл с текстом:

// let text = 'строка1\nстрока2\nстрока3\n...\nстрока25';
// Напишите код, который разложит части этого текста по файлам. Положите первые 10 строк текста в файл 1.txt, вторые 10 строк в файл 2.txt и так далее.

// №7

// Дан файл с текстом:

// let text = 'aaa 12 bbb 345 ccc 67 ddd';
// В этом тексте встречаются числа. Найдите эти числа и запишите их в новый файл, каждое число на своей строке.

// №8

// Дан файл с текстом:

// let text = 'aaa test@mail.com bbb user@site.ru ccc';
// В этом тексте встречаются емейлы. Найдите эти емейлы и запишите их в новый файл, каждый емейл на своей строке.

// №9

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Переставьте местами два заданных ряда:

// [
//     [51, 52, 53, 54, 55],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [11, 12, 13, 14, 15],
// ]
// №10

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Переставьте местами два заданных столбца:

// [
//     [11, 15, 13, 14, 12],
//     [21, 25, 23, 24, 22],
//     [31, 35, 33, 34, 32],
//     [41, 45, 43, 44, 42],
//     [51, 55, 53, 54, 52],
// ]

//!========================================================

// Занимательные задачи JavaScript. Часть 12
// №1

// Дан произвольный двухмерный массив:

// [
//     [11, 32, 13, 44, 55],
//     [31, 42, 53, 66, 75],
//     [12, 26, 33, 45, 52],
//     [15, 22, 35, 64, 57],
//     [21, 52, 32, 44, 38],
// ]
// Найдите максимальный и минимальный элементы и поменяйте их местами.

// №2

// Дан массив из шести цифр:

// let digits = [1, 2, 3, 4, 5, 6];
// Проверьте, можно ли собрать из этих цифр счастливый билет.

// №3

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13],
//     [21, 22, 23],
//     [31, 32, 33],
// ]
// Напишите код, который добавит в него еще один ряд и еще один столбец, заполненные случайными значениями:

// [
//     [11, 12, 13, 14],
//     [21, 22, 23, 24],
//     [31, 32, 33, 34],
//     [41, 42, 43, 44],
// ]
// №4

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Напишите код, который будет обнулять заданный столбец:

// [
//     [11, 12,  0, 14, 15],
//     [21, 22,  0, 24, 25],
//     [31, 32,  0, 34, 35],
//     [41, 42,  0, 44, 45],
//     [51, 52,  0, 54, 55],
// ]
// №5

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Напишите код, который получит массив значений заданного столбца:

// [
//     13, 23, 33, 43, 54
// ]
// №6

// Дан многомерный массив произвольного уровня вложенности:

// {
//     'a': {
//         'b': {
//             'c': '+++'
//         }
//     },
// }
// Сделайте функцию, которая будет возвращать элементы массива, параметром получая строку с ключами массива, разделенными точками:

// func('a.b.c'); // вернет '+++'
// №7

// Дан произвольный двухмерный массив:

// [
//     [11, 12, 13, 14, 15],
//     [21, 22, 23, 24, 25],
//     [31, 32, 33, 34, 35],
//     [41, 42, 43, 44, 45],
//     [51, 52, 53, 54, 55],
// ]
// Выполните его транспонирование:

// [
//     [11, 21, 31, 41, 51],
//     [12, 22, 32, 42, 52],
//     [13, 23, 33, 43, 53],
//     [14, 24, 34, 44, 54],
//     [15, 25, 35, 45, 55],
// ]
// №8

// Дана переменная, содержащая некоторое количество секунд:

// let seconds = 123456;
// Получите сколько дней, часов, минут и секунд содержится в этой переменной. Имеется ввиду, что сначала нужно выделить целое количество дней, из остатка выделить целое количество часов, из остатка выделить целое минут, а затем останется количество секунд. Результат представьте в виде ассоциативного массива.

// №9

// Проверьте, что целое число является степенью другого целого числа. Например, 4 - вторая степень двойки, 9 - вторая степень тройки, 16 - одновременно степень и двойки и четверки. Результатом верните все варианты разложения числа на основание степени и ее показатель.

// №10

// Некоторые слова выглядят одинаково, если заменить русскую букву на английскую и наоборот. Например, русская и английская буквы 'o', а также 'H' и другие, совпадают. Это может создать проблемы на сайте, к примеру, можно зарегистрировать два 'одинаковых' ника с буквами из разных языков и писать от чужого имени.

// Напишите функцию, которая сравнивает строки, учитывая язык - строки, написанные буквами разных языков, но выглядящие одинаково, следует признать равными.

// Для простоты берем только русский и английский языки.

//!========================================================
