// Занимательные задачи JavaScript. Часть 13
// №1

// Дан массив с числами. Подсчитайте количество цифр 3 в данном массиве. Например, в следующем массиве их пять:

// [10, 13, 35, 3, 433]
// №2

// Определите дату ближайшей масленницы (последнее воскресенье зимы). Если в этом году она уже была - покажите за следующий год.

// №3

// Дана переменная, содержащая номер дня года от 1 до 366:

// let day = 100;
// Дана переменная, содержащая год:

// let year = 2020;
// Напишите код, который узнает в какой месяц года приходится заданный день.

// №4

// Пусть есть папка с файлами, названия которых даны на русском языке. Преобразуйте русский текст в названиях файлов в его транслит.

// №5

// В папке лежат файлы картинок. При заходе пользователя на сайт покажите ему случайную картинку из этой папки. Если он обновит страницу или зайдет через некоторое - картинка, показываемая ему, не должна поменяться.

// №6

// Дана строка с любыми символами. Для примера пусть будет такая:

// '1234567890'
// Нужно разбить строку в массив таким образом:

// ['1', '23', '456', '7890']
// И так далее, пока символы в строке не закончатся.

// №7

// Дан текст:

// let text = 'aaa bbb. ccc ddd! eee fff?';
// Сделайте заглавной первую букву каждого предложения в этом тексте.

// №8

// Даны две строки:

// let str1 = 'aaa bbb ccc ddd';
// let str2 = 'bbb xxx ddd yyy';
// Выведите на экран только те слова, которые содержатся в обеих строках.

// №9

// Дано целое число:

// let num = 100;
// Разбейте его на случайное количество целых чисел так, чтобы в сумме они давали это число. Пример: 100 можно разбить на 50+50, или 51+49, или 20+30+50. Количество фрагментов должно быть любым, случайным, сами фрагменты тоже должны быть случайными.

// №10

// Посмотрите на сайт jsfiddle.net и похожие на него. Там при сохранении странице присваивается адрес, состоящий из больших и маленьких букв. При этом адреса не должны повторяться, иначе будет конфликт.

// Придумайте идею, как это сделать, и реализуйте функцию, который будет генерировать случайную строку, которая не встречалась ранее.

//!========================================================

// Занимательные задачи JavaScript. Часть 14
// №1

// Напишите скрипт, который выводит календирик текущего месяца (квадратный, с днями недели).

// №2

// Выведите на экран все счастливые билеты. Счастливый билет - это когда сумма первых трех цифр в номере билета равна сумме второй тройки цифр (номер шестизначный). Подсчитайте сколько счастливых билетов существует и какой % они составляют от общего числа билетов.

// №3

// Дана строка с маленькими буквами:

// let str = 'abc de fghi jk';
// Сделайте заглавными половину случайных букв этой строки, игнорируя пробелы.

// №4

// Дан ряд:

// a, b, c, d ... x, y, z, aa, ab, ac, ... ay, az, ba, bb, ... bz, ... aaz...
// Напишите функцию, которая получит следующий элемент по предыдущему.

// №5

// a) Поделите число 10 на число 7. Найдите 1000-ный знак после запятой у полученной дроби.

// №6

// Дана строка:

// let str = '12345678';
// Сделайте из нее:

// '21436587'
// Строка, конечно же, может быть любой.

// №7

// Дан текст:

// let text = 'aaa bbb ccc aaa ddd bbb';
// Найдите самое часто встречающееся слово в этом тексте.

// №8

// Дан произвольный массив со словами, начинающимися на различные буквы, например, вот такой:

// let arr = [
// 	'axx', 'bxx', 'cxx',
// 	'ayy', 'byy', 'cyy',
// 	'azz', 'bzz', 'czz',
// ];
// Преобразуйте этот массив в двухмерный, в котором ключами будут первые буквы слов, а значениями массивы слов, начинающихся на эти буквы:

// [
// 	'a': [
// 		'axx', 'ayy', 'azz',
// 	],
// 	'b': [
// 		'bxx', 'byy', 'bzz',
// 	],
// 	'c': [
// 		'cxx', 'cyy', 'czz',
// 	],
// ]
// №9

// Дан двухмерный массив:

// {
// 	{
// 		'name': 'user3',
// 		'age': 31,
// 		'salary': 100,
// 	},
// 	{
// 		'name': 'user1',
// 		'age': 32,
// 		'salary': 300,
// 	},
// 	{
// 		'name': 'user2',
// 		'age': 33,
// 		'salary': 200,
// 	},
// }
// Выполните сортировку этого массива по заданному полю (по имени, возрасту или зарплате).

//!========================================================

// Занимательные задачи JavaScript. Часть 15
// №1

// Сделайте функцию, которая будет возвращать заданный знак числа Пи (например, тысячный знак). Номер знака передается параметром функции.

// №2

// Дано некоторое число прописью:

// let str = '
// 	один миллиард двести тридцать четыре миллиона
// 	пятьсот шестьдесят семь тысяч восемсот девяносто
// ';
// Преобразуйте эту пропись в нормальное число:

// 1234567890
// Ваш код, конечно же, должен быть универсальным и работать для любых чисел в пределах миллиардов.

// №3

// Дан массив:

// let arr = [1, 2, 3, 2, 4, 3, 5, 2];
// Удалите из него все элементы, которые встречаются только один раз.

// №4

// Сделайте функцию, которая будет принимать цвет в hex формате и делать его более темного оттенка.

// №5

// Дан текст:

// let text = 'aaa bbb bbb ccc ddd ddd eee';
// Найдите все места с двумя одинаковыми словами подряд и удалите лишние слова.

// №6

// Даны две даты в формате год-месяц-день:

// let date1 = '2025-01-15';
// let date2 = '2025-03-20';
// Найдите разницу в днях между этими датами.

// №7

// Дан текст:

// let text = 'aaa bbb ccc book keep aab';
// Получите массив слов, у которых есть две одинаковые буквы подряд.

// №8

// Дан многомерный массив произвольного уровня вложенности:

// let arr = {
// 		'a': {
// 			'b': {
// 				'c': '+++'
// 			}
// 		}
// 	};
// Сделайте функцию, с помощью которой можно будет получить значения элемента с любого уровня вложенности, указав ключи последовательно через точку:

// let res = func('a.b.c', arr);
// console.log(res); // '+++'
// №9

// Выведите даты ближайших 10-ти вторников.

// №10

// Дан текст:

// let text = 'aaa bbb ccc book keep aab';
// Получите массив слов, у которых есть одинаковые буквы.

//!========================================================

// Занимательные задачи JavaScript. Часть 16
// №1

// Дан ООП класс:

// class User {
// 	constructor(name) {
// 		this.name = name;
// 	}
// }
// Сделайте так, чтобы этот класс считал количество своих объектов.

// №2

// Дан блок, содержащий HTML ссылки:

// <div>
// 	<a href="/page1.html">page1</a>
// 	<a href="/page2.html">page2</a>
// 	<a href="/page3.html">page3</a>
// </div>
// Сделайте функцию, которая параметром будет принимать href ссылки и возвращать href соседа сверху для заданной ссылки.

// №3

// Дан текст:

// let text = 'aaa bbb ccc book keep aab';
// Получите массив слов, состоящих из разных букв.

// №4

// Сделайте аналог функции trim.

// №5

// Найдите все тройки Пифагора в промежутке от 1 до 10000.

// №6

// Реализуйте функцию flatten, которая в случае, если массив обладает уровнями вложенности (любой глубины), приведёт его к элементарному виду. Пример:

// flatten([1, [2], [3, [[[4]]]]]) // [1, 2, 3, 4]
// №7

// Сделайте функцию, которая будет генерировать случайный цвет в hex формате (типа #ffffff).

// №8

// Напишите функцию, которая корректно будет складывать часы и минуты. Пример.

// func('1ч 20 мин + 50 мин') // 2ч 10 мин
// №9

// Обрежьте длинную строку так, чтобы ее длина была не более N символов. При этом слова не должны быть разорваны - обрезание всегда проходит по пробелу и новая строка всегда меньше N.

// №10

// Подсчитайте суммарное количество цифр в числах от 1 до 1 000 000.

//!========================================================

// Занимательные задачи JavaScript. Часть 17
// №1

// Дан многомерный массив:

// let arr = [1, [2, 3], [4, [5, 6]], 7];
// Подсчитайте количество элементов, не являющихся массивами, во всех уровнях вложенности.

// №2

// Проверьте сложность пароля. Сложный пароль - это пароль с маленькими латинскими, большими латинскими буквами, цифрами и спецсимволами. Придумайте свои критерии, например, не должно идти несколько одинаковых символов подряд и так далее.
// При решении задачи указывайте свои критерии также.

// №3

// Напишите функцию, которая параметрами будет принимать два массива:

// let res = func([1, 2, 3], ['a', 'b', 'c']);
// А в качестве результата сливать эти массивы таким образом:

// console.log(res); // [1, 'a', 2, 'b', 3, 'c']
// №4

// Написать функцию, на вход которой подается массив с числовыми элементами. Функция должна вернуть отсортированный массив по частоте повтора элементов в нем.

// Пример. На вход функции подаем следующий массив:

// [5, 9, 2, 4, 1, 2, 5, 8, 2, 2, 8, 4, 5]
// В результате после сортировки получим следующий массив:

// [2, 2, 2, 2, 5, 5, 5, 4, 4, 8, 8, 9, 1]
// №5

// Найдите все ЦЕЛЫЕ решения уравнения x^y = y^x.

// №6

// Сделайте функцию, которая будет проверять, являются ли два числа дружественными.

// №7

// Сделайте функцию, которая будет проверять, является ли число совершенным.

// №8

// Дан массив с числами:

// let arr = [1, 2, 3, 5, 4, 6, 7];
// Проверьте, что элементы массива выстроены по возрастанию. Допустимо, однако, одно место, в котором следующий элемент меньше предыдущего.

// Задача с реального проекта, анализ ставок тотализатора, дана в упрощенном виде.

// №9

// Дана строка с текстом. В этом тексте есть цены в долларах:

// 'текст 10$ текст 20$';
// Найдите все цены в этой строке и увеличьте их на 10%:

// 'текст 11$ текст 22$';
// №10

// Сделайте функцию, которая будет удалять дубли, встречающиеся более 3-х раз.

//!========================================================

// Занимательные задачи JavaScript. Часть 18
// №1

// Дан произвольный многомерный массив:

// let arr = [1, [2, [3, [4]]], 5];
// Определите максимальный уровень вложенности этого массива.

// №2

// Дан массив:

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// Запишите в другой массив N случайных элементов из него так, чтобы один элемент был использован только один раз.

// №3

// Найдите суммарное количество единиц в числах от 1 до 100.

// №4

// Напишите функцию, которая подсчитает, сколько слов в строке начинаются на заданную букву.

// №5

// Дан массив товаров с ценами:

// let products = {
// 	'product1': 100,
// 	'product2': 200,
// 	'product3': 300,
// 	'product4': 400,
// };
// Дана сумма:

// let sum = 500;
// Выведите все возможные комбинации товаров, которые можно купить на эту сумму.

// №6

// Нарисуйте в браузере треугольник Паскаля произвольного размера.

// №7

// Напишите скрипт, который считывает название файлов из папки и, если эти названия на русском, меняет их на транслит.

// №8

// Реализуйте функцию, которая будет принимать два целых числа, и проверять, результатом деления получается периодическая дробь или нет.

// №9

// Напишите функцию, которая подсчитает, сколько слов в строке заканчиваются на заданную букву.

// №10

// Напишите функцию, которая из единственного числа английского существительного делает множественное. Не забудьте про слова-исключения.

//!========================================================

// Занимательные задачи JavaScript. Часть 19
// №1

// Напишите функцию, которая преобразует строки вида:

// 'var_php_test'
// в:

// 'varPhpTest'
// №2

// Дана строка:

// let str = '12 34 56 78';
// Удалите из нее третий пробел:

// '12 34 5678'
// №3

// Найдите, какое число было 100 дней назад.

// №4

// Дано число:

// let num = 123;
// Выведите на экран все возможные перестановки его цифр.

// №5

// Дан массив:

// let arr = [1, 2, 3, 2, 4];
// Определите, есть ли в нем повторяющиеся элементы.

// №6

// Нарисуйте следующую пирамидку, не используя цикл:

// 1
// 22
// 333
// 4444
// 55555
// 666666
// 7777777
// 88888888
// 999999999
// №7

// Сгенерируйте случайное целое число из промежутка от 10 до 30 и от 50 до 80.

// №8

// Сделайте функцию, которая выводит случайное число от 1 до 100. При этом вызовы функции не должны выдавать два одинаковых числа подряд.

// №9

// Вывести случайное число в заданном промежутке, к примеру от 1 до 100. Случайное число может быть целым 3, или половинкой 3.5.

//!========================================================

// Занимательные задачи JavaScript. Часть 20
// №1

// Дан объект:

// let obj = {a: 1, b: 2, c: 3, d: 4};
// Перемешайте его значения, оторвав их от ключей.

// №2

// Напишите скрипт, который сгенерирует 10 кругов разного размера и разместит их на странице случайным образом, но так, чтобы они не накладывались друг на друга.

// №3

// Даны два дива с круглыми границами. Эти круги частично накладываются друг на друга. Найдите площадь наложения.

// №4

// Напишите программу, которая будет имитировать работу светофора для машин.

// №5

// Напишите скрипт, который нарисует звезду на канвасе.

// №6

// Даны два дива разных размеров и кнопка. По клику на кнопку поставьте центр меньшего дива в центр большего.

// №7

// Дан див. По клику на этот див поставьте в центре этого дива точку.

// №8

// Дан див. Нарисуйте пунктирными линиями диагонали этого дива.

// №9

// Даны два дива. Найдите расстояние между их центрами.

// №10

// Даны два дива и кнопка. По клику на кнопку проверьте, накладываются ли два дива друг на друга. Если это так, то раздвиньте дивы в разные стороны так, чтобы наложение пропало.

//!========================================================

// Занимательные задачи JavaScript. Часть 21
// №1

// Дан див. Проверьте, видим ли этот див целиком или часть его скрыта за границами окна браузера.

// №2

// Дан див и кнопка. По клику на кнопку плавно прокрутите страницу к этому диву.

// №3

// Получите урл из адресной строки браузера. Извлеките из него имя файла.

// №4

// Нарисуйте цветок на канвасе.

// №5

// На странице есть прямоугольные дивы. Найдите их суммарную площадь.

// №6

// На странице есть прямоугольные дивы. Найдите их суммарный периметр.

// №7

// На странице есть прямоугольные дивы. Найдите дивы, у которых есть граница.

// №8

// Нарисуйте смайлик на канвасе.

// №9

// На странице есть прямоугольные дивы. Найдите суммарную площадь границ этих дивов.

// №10

// Даны дивы с числами:

// <div>1</div>
// <div>2</div>
// <div>3</div>
// Сделайте так, чтобы дивы можно было перетягивать и бросать на другие дивы. В момент бросания перетягиваемый див уничтожается, а его значение прибавляется к целевому диву.

//!========================================================

// Занимательные задачи JavaScript. Часть 22
// №1

// На странице нарисована колода карт. По нажатию на колоду из нее должны вылететь 6 случайных карт.

// №2

// Даны инпуты. В любой инпут можно ввести текст и нажать Enter. После этого текст из инпута исчезает. Сделайте так, чтобы каждый инпут запоминал введенные тексты. Над каждым инпутом разместите стрелочки, с помощью которых можно будет возвращать предыдущий введенный текст в инпут.

// №3

// Дана строка с тегами и атрибутами:

// let str = '<div id="elem" class="www"></div>';
// Напишите скрипт, который получит атрибуты и их значения в виде массива объектов. Объекты должны хранить имя и значения атрибута.

// №4

// Даны три кнопки. Сделайте так, чтобы по клику каждая кнопка издавала свой звук.

// №5

// Дана кнопка. По клику на эту кнопку заставьте браузер вернуться назад по истории браузера.

// №6

// Пусть в адресной строке браузера у вас написано:

// 'index.html?page=3'
// Увеличьте значение параметра page на единицу. Изменение должно произойти прямо в адресной строке.

// №7

// Дана кнопка. По клику на кнопку выведите адрес страницы, с которой был осуществлен переход на текущую страницу.

// №8

// Дана кнопка. По нажатию на кнопку выведите язык браузера пользователя.

// №9

// Даны два дива. Соедините линией центры этих дивов.

// №10

// Даны два дива. Соедините линией ближайшие углы этих дивов.

//!========================================================

// Занимательные задачи JavaScript. Часть 23
// №1

// На странице есть дивы, которые могут накладываться друг на друга. Найдите суммарную площадь дивов с учетом того, что наложение дивов считается только один раз.

// №2

// Даны три дива. Соедините линией центры этих дивов.

// №3

// Напишите скрипт, который сделает снег на странице браузера.

// №4

// Дан квадратный див. Напишите скрипт, который опишет круг вокруг этого дива.

// №5

// Сделайте так, чтобы у всех строк появился метод ucFirst, который будет переводить первый символ строки в верхний регистр.

// Смотрите пример:

// 'abc'.ucFirst(); // 'Abc'
// №6

// В текстареа вводится текст со словами. По потери фокуса сделайте таблицу, в первой колонке которой будут слова из текста, во второй колонке - количество раз, которое это слово встречается, а в третьей - процентное содержание этого слова в тексте.

// №7

// Дан массив со словами:

// let arr = ['apple', 'apricot', 'banana', 'berry', 'cherry'];
// Выведите слова, начинающиеся на одинаковые буквы в своем отдельном списке ul. Над каждым списком сделайте h2 с названием буквы, для которой сделан список.

// №8

// Дан абзац со словами и инпут. В инпут вводится слово. По клику на кнопку найдите это слово в абзаце и покрасьте его в красный цвет.

// №9

// Дан инпут, кнопка и список ul. В инпут вводится число. По клику на кнопку выведите список всех возможных вариантов разложения числа на два множителя.

// №10

// Даны два селекта. В первом селекте выводятся страны. Сделайте так, чтобы во втором селекте выводились города выбранной страны.

//!========================================================

// Занимательные задачи JavaScript. Часть 24
// №1

// Дано меню со ссылками. Сделайте так, чтобы по клику на ссылку меню под ней выпадало подменю.

// №2

// Дан див. У этого дива есть крестик закрытия. Сделайте так, чтобы по клику на крестик, либо на любое место страницы вне дива, этот див прятался.

// №3

// Дан текстареа и ul. В текстареа вводится текст. Сделайте так, чтобы по нажатию Shift + Enter каждая строка текста добавилась в список в виде отдельного тега li.

// №4

// Дан некоторый массив:

// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
// Дана переменная:

// let n = 3;
// Превратите этот массив в двухмерный, по n элементов в подмассиве.

// №5

// Дан массив:

// [
// 	[1, 2, 3, 4, 5],
// 	[1, 2, 3],
// 	[1, 2],
// ]
// Добавьте в каждый подмассив столько пустых строк, чтобы количество элементов в каждом подмассиве стало равно количеству элементов в самом длинном подмассиве.

// №6

// Дан список ul и кнопка. По нажатию на кнопку перемешайте пункты списка в случайном порядке.

// №7

// Дан массив со словами:

// let arr = ['apple', 'apricot', 'banana', 'berry', 'cherry'];
// Получите из этого массива случайное слово, начинающееся на заданную букву.

// №8

// Дан массив с точками:

// [
// 	[1, 2], [2, 4], [3, 8], [4, 16], [5, 32]
// ]
// Отрисуйте эти точки на графике.

// №9

// Дана таблица. По нажатию на кнопку добавьте в эту таблицу и новый ряд, и новую колонку.

// №10

// Дана таблица и кнопка. По нажатию на кнопку покрасьте в красный цвет случайную ячейку таблицы. Повторное нажатие на кнопку должно закрашивать новую незакрашенную ячейку, пока ячейки не закончатся.

//!========================================================
